use cudarc::driver::sys::*;
/* automatically generated by rust-bindgen 0.71.1 */

pub type CUvideodecoder = *mut ::core::ffi::c_void;
pub type CUvideoctxlock = *mut _CUcontextlock_st;
pub type CUVIDDECODECAPS = _CUVIDDECODECAPS;
pub type CUVIDDECODECREATEINFO = _CUVIDDECODECREATEINFO;
pub type CUVIDH264DPBENTRY = _CUVIDH264DPBENTRY;
pub type CUVIDH264MVCEXT = _CUVIDH264MVCEXT;
pub type CUVIDH264SVCEXT = _CUVIDH264SVCEXT;
pub type CUVIDH264PICPARAMS = _CUVIDH264PICPARAMS;
pub type CUVIDMPEG2PICPARAMS = _CUVIDMPEG2PICPARAMS;
pub type CUVIDMPEG4PICPARAMS = _CUVIDMPEG4PICPARAMS;
pub type CUVIDVC1PICPARAMS = _CUVIDVC1PICPARAMS;
pub type CUVIDJPEGPICPARAMS = _CUVIDJPEGPICPARAMS;
pub type CUVIDHEVCPICPARAMS = _CUVIDHEVCPICPARAMS;
pub type CUVIDVP8PICPARAMS = _CUVIDVP8PICPARAMS;
pub type CUVIDVP9PICPARAMS = _CUVIDVP9PICPARAMS;
pub type CUVIDAV1PICPARAMS = _CUVIDAV1PICPARAMS;
pub type CUVIDPICPARAMS = _CUVIDPICPARAMS;
pub type CUVIDPROCPARAMS = _CUVIDPROCPARAMS;
pub type CUVIDGETDECODESTATUS = _CUVIDGETDECODESTATUS;
pub type CUVIDRECONFIGUREDECODERINFO = _CUVIDRECONFIGUREDECODERINFO;
#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CUcontextlock_st {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _CUVIDDECODECAPS {
    pub eCodecType: cudaVideoCodec,

    pub FrameHeightInMbs: ::core::ffi::c_int,
    pub CurrPicIdx: ::core::ffi::c_int,
    pub field_pic_flag: ::core::ffi::c_int,
    pub bottom_field_flag: ::core::ffi::c_int,
    pub second_field: ::core::ffi::c_int,
    pub nBitstreamDataLen: ::core::ffi::c_uint,
    pub pBitstreamData: *const ::core::ffi::c_uchar,
    pub nNumSlices: ::core::ffi::c_uint,
    pub pSliceDataOffsets: *const ::core::ffi::c_uint,
    pub ref_pic_flag: ::core::ffi::c_int,
    pub intra_pic_flag: ::core::ffi::c_int,
    pub Reserved: [::core::ffi::c_uint; 30usize],
    pub CodecSpecific: _CUVIDPICPARAMS__bindgen_ty_1,
}
#[repr(C)]
pub struct _CUVIDPROCPARAMS {
    pub progressive_frame: ::core::ffi::c_int,
    pub second_field: ::core::ffi::c_int,
    pub top_field_first: ::core::ffi::c_int,
    pub unpaired_field: ::core::ffi::c_int,
    pub reserved_flags: ::core::ffi::c_uint,
    pub reserved_zero: ::core::ffi::c_uint,
    pub raw_input_dptr: ::core::ffi::c_ulonglong,
    pub raw_input_pitch: ::core::ffi::c_uint,
    pub raw_input_format: ::core::ffi::c_uint,
    pub raw_output_dptr: ::core::ffi::c_ulonglong,
    pub raw_output_pitch: ::core::ffi::c_uint,
    pub Reserved1: ::core::ffi::c_uint,
    pub output_stream: CUstream,
    pub Reserved: [::core::ffi::c_uint; 46usize],
    pub histogram_dptr: *mut ::core::ffi::c_ulonglong,
    pub Reserved2: [*mut ::core::ffi::c_void; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _CUVIDGETDECODESTATUS {
    pub decodeStatus: cuvidDecodeStatus,
    pub reserved: [::core::ffi::c_uint; 31usize],
    pub pReserved: [*mut ::core::ffi::c_void; 8usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _CUVIDRECONFIGUREDECODERINFO {
    pub ulWidth: ::core::ffi::c_uint,
    pub ulHeight: ::core::ffi::c_uint,
    pub ulTargetWidth: ::core::ffi::c_uint,
    pub ulTargetHeight: ::core::ffi::c_uint,
    pub ulNumDecodeSurfaces: ::core::ffi::c_uint,
    pub reserved1: [::core::ffi::c_uint; 12usize],
    pub display_area: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1,
    pub target_rect: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2,
    pub reserved2: [::core::ffi::c_uint; 11usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1 {
    pub left: ::core::ffi::c_short,
    pub top: ::core::ffi::c_short,
    pub right: ::core::ffi::c_short,
    pub bottom: ::core::ffi::c_short,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2 {
    pub left: ::core::ffi::c_short,
    pub top: ::core::ffi::c_short,
    pub right: ::core::ffi::c_short,
    pub bottom: ::core::ffi::c_short,
}
pub const I_VOP: u32 = 0;
pub const P_VOP: u32 = 1;
pub const B_VOP: u32 = 2;
pub const S_VOP: u32 = 3;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDDECODECAPS"][::core::mem::size_of::<_CUVIDDECODECAPS>() - 88usize];
    ["Alignment of _CUVIDDECODECAPS"][::core::mem::align_of::<_CUVIDDECODECAPS>() - 4usize];
    ["Offset of field: _CUVIDDECODECAPS::eCodecType"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, eCodecType) - 0usize];
    ["Offset of field: _CUVIDDECODECAPS::eChromaFormat"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, eChromaFormat) - 4usize];
    ["Offset of field: _CUVIDDECODECAPS::nBitDepthMinus8"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nBitDepthMinus8) - 8usize];
    ["Offset of field: _CUVIDDECODECAPS::reserved1"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, reserved1) - 12usize];
    ["Offset of field: _CUVIDDECODECAPS::bIsSupported"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, bIsSupported) - 24usize];
    ["Offset of field: _CUVIDDECODECAPS::nNumNVDECs"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nNumNVDECs) - 25usize];
    ["Offset of field: _CUVIDDECODECAPS::nOutputFormatMask"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nOutputFormatMask) - 26usize];
    ["Offset of field: _CUVIDDECODECAPS::nMaxWidth"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nMaxWidth) - 28usize];
    ["Offset of field: _CUVIDDECODECAPS::nMaxHeight"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nMaxHeight) - 32usize];
    ["Offset of field: _CUVIDDECODECAPS::nMaxMBCount"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nMaxMBCount) - 36usize];
    ["Offset of field: _CUVIDDECODECAPS::nMinWidth"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nMinWidth) - 40usize];
    ["Offset of field: _CUVIDDECODECAPS::nMinHeight"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nMinHeight) - 42usize];
    ["Offset of field: _CUVIDDECODECAPS::bIsHistogramSupported"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, bIsHistogramSupported) - 44usize];
    ["Offset of field: _CUVIDDECODECAPS::nCounterBitDepth"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nCounterBitDepth) - 45usize];
    ["Offset of field: _CUVIDDECODECAPS::nMaxHistogramBins"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, nMaxHistogramBins) - 46usize];
    ["Offset of field: _CUVIDDECODECAPS::reserved3"]
        [::core::mem::offset_of!(_CUVIDDECODECAPS, reserved3) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDDECODECREATEINFO__bindgen_ty_1"]
        [::core::mem::size_of::<_CUVIDDECODECREATEINFO__bindgen_ty_1>() - 8usize];
    ["Alignment of _CUVIDDECODECREATEINFO__bindgen_ty_1"]
        [::core::mem::align_of::<_CUVIDDECODECREATEINFO__bindgen_ty_1>() - 2usize];
    ["Offset of field: _CUVIDDECODECREATEINFO__bindgen_ty_1::left"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO__bindgen_ty_1, left) - 0usize];
    ["Offset of field: _CUVIDDECODECREATEINFO__bindgen_ty_1::top"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO__bindgen_ty_1, top) - 2usize];
    ["Offset of field: _CUVIDDECODECREATEINFO__bindgen_ty_1::right"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO__bindgen_ty_1, right) - 4usize];
    ["Offset of field: _CUVIDDECODECREATEINFO__bindgen_ty_1::bottom"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO__bindgen_ty_1, bottom) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDDECODECREATEINFO__bindgen_ty_2"]
        [::core::mem::size_of::<_CUVIDDECODECREATEINFO__bindgen_ty_2>() - 8usize];
    ["Alignment of _CUVIDDECODECREATEINFO__bindgen_ty_2"]
        [::core::mem::align_of::<_CUVIDDECODECREATEINFO__bindgen_ty_2>() - 2usize];
    ["Offset of field: _CUVIDDECODECREATEINFO__bindgen_ty_2::left"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO__bindgen_ty_2, left) - 0usize];
    ["Offset of field: _CUVIDDECODECREATEINFO__bindgen_ty_2::top"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO__bindgen_ty_2, top) - 2usize];
    ["Offset of field: _CUVIDDECODECREATEINFO__bindgen_ty_2::right"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO__bindgen_ty_2, right) - 4usize];
    ["Offset of field: _CUVIDDECODECREATEINFO__bindgen_ty_2::bottom"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO__bindgen_ty_2, bottom) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDDECODECREATEINFO"][::core::mem::size_of::<_CUVIDDECODECREATEINFO>() - 176usize];
    ["Alignment of _CUVIDDECODECREATEINFO"]
        [::core::mem::align_of::<_CUVIDDECODECREATEINFO>() - 8usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulWidth"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulWidth) - 0usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulHeight"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulHeight) - 8usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulNumDecodeSurfaces"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulNumDecodeSurfaces) - 16usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::CodecType"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, CodecType) - 24usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ChromaFormat"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ChromaFormat) - 28usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulCreationFlags"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulCreationFlags) - 32usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::bitDepthMinus8"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, bitDepthMinus8) - 40usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulIntraDecodeOnly"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulIntraDecodeOnly) - 48usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulMaxWidth"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulMaxWidth) - 56usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulMaxHeight"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulMaxHeight) - 64usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::Reserved1"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, Reserved1) - 72usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::display_area"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, display_area) - 80usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::OutputFormat"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, OutputFormat) - 88usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::DeinterlaceMode"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, DeinterlaceMode) - 92usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulTargetWidth"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulTargetWidth) - 96usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulTargetHeight"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulTargetHeight) - 104usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::ulNumOutputSurfaces"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, ulNumOutputSurfaces) - 112usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::vidLock"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, vidLock) - 120usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::target_rect"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, target_rect) - 128usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::enableHistogram"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, enableHistogram) - 136usize];
    ["Offset of field: _CUVIDDECODECREATEINFO::Reserved2"]
        [::core::mem::offset_of!(_CUVIDDECODECREATEINFO, Reserved2) - 144usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDH264DPBENTRY"][::core::mem::size_of::<_CUVIDH264DPBENTRY>() - 28usize];
    ["Alignment of _CUVIDH264DPBENTRY"][::core::mem::align_of::<_CUVIDH264DPBENTRY>() - 4usize];
    ["Offset of field: _CUVIDH264DPBENTRY::PicIdx"]
        [::core::mem::offset_of!(_CUVIDH264DPBENTRY, PicIdx) - 0usize];
    ["Offset of field: _CUVIDH264DPBENTRY::FrameIdx"]
        [::core::mem::offset_of!(_CUVIDH264DPBENTRY, FrameIdx) - 4usize];
    ["Offset of field: _CUVIDH264DPBENTRY::is_long_term"]
        [::core::mem::offset_of!(_CUVIDH264DPBENTRY, is_long_term) - 8usize];
    ["Offset of field: _CUVIDH264DPBENTRY::not_existing"]
        [::core::mem::offset_of!(_CUVIDH264DPBENTRY, not_existing) - 12usize];
    ["Offset of field: _CUVIDH264DPBENTRY::used_for_reference"]
        [::core::mem::offset_of!(_CUVIDH264DPBENTRY, used_for_reference) - 16usize];
    ["Offset of field: _CUVIDH264DPBENTRY::FieldOrderCnt"]
        [::core::mem::offset_of!(_CUVIDH264DPBENTRY, FieldOrderCnt) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDH264MVCEXT"][::core::mem::size_of::<_CUVIDH264MVCEXT>() - 140usize];
    ["Alignment of _CUVIDH264MVCEXT"][::core::mem::align_of::<_CUVIDH264MVCEXT>() - 4usize];
    ["Offset of field: _CUVIDH264MVCEXT::num_views_minus1"]
        [::core::mem::offset_of!(_CUVIDH264MVCEXT, num_views_minus1) - 0usize];
    ["Offset of field: _CUVIDH264MVCEXT::view_id"]
        [::core::mem::offset_of!(_CUVIDH264MVCEXT, view_id) - 4usize];
    ["Offset of field: _CUVIDH264MVCEXT::inter_view_flag"]
        [::core::mem::offset_of!(_CUVIDH264MVCEXT, inter_view_flag) - 8usize];
    ["Offset of field: _CUVIDH264MVCEXT::num_inter_view_refs_l0"]
        [::core::mem::offset_of!(_CUVIDH264MVCEXT, num_inter_view_refs_l0) - 9usize];
    ["Offset of field: _CUVIDH264MVCEXT::num_inter_view_refs_l1"]
        [::core::mem::offset_of!(_CUVIDH264MVCEXT, num_inter_view_refs_l1) - 10usize];
    ["Offset of field: _CUVIDH264MVCEXT::MVCReserved8Bits"]
        [::core::mem::offset_of!(_CUVIDH264MVCEXT, MVCReserved8Bits) - 11usize];
    ["Offset of field: _CUVIDH264MVCEXT::InterViewRefsL0"]
        [::core::mem::offset_of!(_CUVIDH264MVCEXT, InterViewRefsL0) - 12usize];
    ["Offset of field: _CUVIDH264MVCEXT::InterViewRefsL1"]
        [::core::mem::offset_of!(_CUVIDH264MVCEXT, InterViewRefsL1) - 76usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDH264SVCEXT"][::core::mem::size_of::<_CUVIDH264SVCEXT>() - 48usize];
    ["Alignment of _CUVIDH264SVCEXT"][::core::mem::align_of::<_CUVIDH264SVCEXT>() - 8usize];
    ["Offset of field: _CUVIDH264SVCEXT::profile_idc"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, profile_idc) - 0usize];
    ["Offset of field: _CUVIDH264SVCEXT::level_idc"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, level_idc) - 1usize];
    ["Offset of field: _CUVIDH264SVCEXT::DQId"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, DQId) - 2usize];
    ["Offset of field: _CUVIDH264SVCEXT::DQIdMax"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, DQIdMax) - 3usize];
    ["Offset of field: _CUVIDH264SVCEXT::disable_inter_layer_deblocking_filter_idc"][::core::mem::offset_of!(
        _CUVIDH264SVCEXT,
        disable_inter_layer_deblocking_filter_idc
    ) - 4usize];
    ["Offset of field: _CUVIDH264SVCEXT::ref_layer_chroma_phase_y_plus1"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, ref_layer_chroma_phase_y_plus1) - 5usize];
    ["Offset of field: _CUVIDH264SVCEXT::inter_layer_slice_alpha_c0_offset_div2"][::core::mem::offset_of!(
        _CUVIDH264SVCEXT,
        inter_layer_slice_alpha_c0_offset_div2
    ) - 6usize];
    ["Offset of field: _CUVIDH264SVCEXT::inter_layer_slice_beta_offset_div2"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, inter_layer_slice_beta_offset_div2) - 7usize];
    ["Offset of field: _CUVIDH264SVCEXT::DPBEntryValidFlag"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, DPBEntryValidFlag) - 8usize];
    ["Offset of field: _CUVIDH264SVCEXT::inter_layer_deblocking_filter_control_present_flag"][::core::mem::offset_of!(
        _CUVIDH264SVCEXT,
        inter_layer_deblocking_filter_control_present_flag
    )
        - 10usize];
    ["Offset of field: _CUVIDH264SVCEXT::extended_spatial_scalability_idc"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, extended_spatial_scalability_idc) - 11usize];
    ["Offset of field: _CUVIDH264SVCEXT::adaptive_tcoeff_level_prediction_flag"][::core::mem::offset_of!(
        _CUVIDH264SVCEXT,
        adaptive_tcoeff_level_prediction_flag
    ) - 12usize];
    ["Offset of field: _CUVIDH264SVCEXT::slice_header_restriction_flag"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, slice_header_restriction_flag) - 13usize];
    ["Offset of field: _CUVIDH264SVCEXT::chroma_phase_x_plus1_flag"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, chroma_phase_x_plus1_flag) - 14usize];
    ["Offset of field: _CUVIDH264SVCEXT::chroma_phase_y_plus1"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, chroma_phase_y_plus1) - 15usize];
    ["Offset of field: _CUVIDH264SVCEXT::tcoeff_level_prediction_flag"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, tcoeff_level_prediction_flag) - 16usize];
    ["Offset of field: _CUVIDH264SVCEXT::constrained_intra_resampling_flag"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, constrained_intra_resampling_flag) - 17usize];
    ["Offset of field: _CUVIDH264SVCEXT::ref_layer_chroma_phase_x_plus1_flag"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, ref_layer_chroma_phase_x_plus1_flag) - 18usize];
    ["Offset of field: _CUVIDH264SVCEXT::store_ref_base_pic_flag"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, store_ref_base_pic_flag) - 19usize];
    ["Offset of field: _CUVIDH264SVCEXT::Reserved8BitsA"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, Reserved8BitsA) - 20usize];
    ["Offset of field: _CUVIDH264SVCEXT::Reserved8BitsB"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, Reserved8BitsB) - 21usize];
    ["Offset of field: _CUVIDH264SVCEXT::scaled_ref_layer_left_offset"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, scaled_ref_layer_left_offset) - 22usize];
    ["Offset of field: _CUVIDH264SVCEXT::scaled_ref_layer_top_offset"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, scaled_ref_layer_top_offset) - 24usize];
    ["Offset of field: _CUVIDH264SVCEXT::scaled_ref_layer_right_offset"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, scaled_ref_layer_right_offset) - 26usize];
    ["Offset of field: _CUVIDH264SVCEXT::scaled_ref_layer_bottom_offset"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, scaled_ref_layer_bottom_offset) - 28usize];
    ["Offset of field: _CUVIDH264SVCEXT::Reserved16Bits"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, Reserved16Bits) - 30usize];
    ["Offset of field: _CUVIDH264SVCEXT::pNextLayer"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, pNextLayer) - 32usize];
    ["Offset of field: _CUVIDH264SVCEXT::bRefBaseLayer"]
        [::core::mem::offset_of!(_CUVIDH264SVCEXT, bRefBaseLayer) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDH264PICPARAMS__bindgen_ty_1"]
        [::core::mem::size_of::<_CUVIDH264PICPARAMS__bindgen_ty_1>() - 8usize];
    ["Alignment of _CUVIDH264PICPARAMS__bindgen_ty_1"]
        [::core::mem::align_of::<_CUVIDH264PICPARAMS__bindgen_ty_1>() - 8usize];
    ["Offset of field: _CUVIDH264PICPARAMS__bindgen_ty_1::slice_group_map_addr"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS__bindgen_ty_1, slice_group_map_addr) - 0usize];
    ["Offset of field: _CUVIDH264PICPARAMS__bindgen_ty_1::pMb2SliceGroupMap"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS__bindgen_ty_1, pMb2SliceGroupMap) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDH264PICPARAMS__bindgen_ty_2"]
        [::core::mem::size_of::<_CUVIDH264PICPARAMS__bindgen_ty_2>() - 144usize];
    ["Alignment of _CUVIDH264PICPARAMS__bindgen_ty_2"]
        [::core::mem::align_of::<_CUVIDH264PICPARAMS__bindgen_ty_2>() - 8usize];
    ["Offset of field: _CUVIDH264PICPARAMS__bindgen_ty_2::mvcext"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS__bindgen_ty_2, mvcext) - 0usize];
    ["Offset of field: _CUVIDH264PICPARAMS__bindgen_ty_2::svcext"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS__bindgen_ty_2, svcext) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDH264PICPARAMS"][::core::mem::size_of::<_CUVIDH264PICPARAMS>() - 984usize];
    ["Alignment of _CUVIDH264PICPARAMS"][::core::mem::align_of::<_CUVIDH264PICPARAMS>() - 8usize];
    ["Offset of field: _CUVIDH264PICPARAMS::log2_max_frame_num_minus4"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, log2_max_frame_num_minus4) - 0usize];
    ["Offset of field: _CUVIDH264PICPARAMS::pic_order_cnt_type"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, pic_order_cnt_type) - 4usize];
    ["Offset of field: _CUVIDH264PICPARAMS::log2_max_pic_order_cnt_lsb_minus4"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, log2_max_pic_order_cnt_lsb_minus4) - 8usize];
    ["Offset of field: _CUVIDH264PICPARAMS::delta_pic_order_always_zero_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, delta_pic_order_always_zero_flag) - 12usize];
    ["Offset of field: _CUVIDH264PICPARAMS::frame_mbs_only_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, frame_mbs_only_flag) - 16usize];
    ["Offset of field: _CUVIDH264PICPARAMS::direct_8x8_inference_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, direct_8x8_inference_flag) - 20usize];
    ["Offset of field: _CUVIDH264PICPARAMS::num_ref_frames"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, num_ref_frames) - 24usize];
    ["Offset of field: _CUVIDH264PICPARAMS::residual_colour_transform_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, residual_colour_transform_flag) - 28usize];
    ["Offset of field: _CUVIDH264PICPARAMS::bit_depth_luma_minus8"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, bit_depth_luma_minus8) - 29usize];
    ["Offset of field: _CUVIDH264PICPARAMS::bit_depth_chroma_minus8"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, bit_depth_chroma_minus8) - 30usize];
    ["Offset of field: _CUVIDH264PICPARAMS::qpprime_y_zero_transform_bypass_flag"][::core::mem::offset_of!(
        _CUVIDH264PICPARAMS,
        qpprime_y_zero_transform_bypass_flag
    ) - 31usize];
    ["Offset of field: _CUVIDH264PICPARAMS::entropy_coding_mode_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, entropy_coding_mode_flag) - 32usize];
    ["Offset of field: _CUVIDH264PICPARAMS::pic_order_present_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, pic_order_present_flag) - 36usize];
    ["Offset of field: _CUVIDH264PICPARAMS::num_ref_idx_l0_active_minus1"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, num_ref_idx_l0_active_minus1) - 40usize];
    ["Offset of field: _CUVIDH264PICPARAMS::num_ref_idx_l1_active_minus1"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, num_ref_idx_l1_active_minus1) - 44usize];
    ["Offset of field: _CUVIDH264PICPARAMS::weighted_pred_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, weighted_pred_flag) - 48usize];
    ["Offset of field: _CUVIDH264PICPARAMS::weighted_bipred_idc"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, weighted_bipred_idc) - 52usize];
    ["Offset of field: _CUVIDH264PICPARAMS::pic_init_qp_minus26"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, pic_init_qp_minus26) - 56usize];
    ["Offset of field: _CUVIDH264PICPARAMS::deblocking_filter_control_present_flag"][::core::mem::offset_of!(
        _CUVIDH264PICPARAMS,
        deblocking_filter_control_present_flag
    ) - 60usize];
    ["Offset of field: _CUVIDH264PICPARAMS::redundant_pic_cnt_present_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, redundant_pic_cnt_present_flag) - 64usize];
    ["Offset of field: _CUVIDH264PICPARAMS::transform_8x8_mode_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, transform_8x8_mode_flag) - 68usize];
    ["Offset of field: _CUVIDH264PICPARAMS::MbaffFrameFlag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, MbaffFrameFlag) - 72usize];
    ["Offset of field: _CUVIDH264PICPARAMS::constrained_intra_pred_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, constrained_intra_pred_flag) - 76usize];
    ["Offset of field: _CUVIDH264PICPARAMS::chroma_qp_index_offset"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, chroma_qp_index_offset) - 80usize];
    ["Offset of field: _CUVIDH264PICPARAMS::second_chroma_qp_index_offset"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, second_chroma_qp_index_offset) - 84usize];
    ["Offset of field: _CUVIDH264PICPARAMS::ref_pic_flag"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, ref_pic_flag) - 88usize];
    ["Offset of field: _CUVIDH264PICPARAMS::frame_num"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, frame_num) - 92usize];
    ["Offset of field: _CUVIDH264PICPARAMS::CurrFieldOrderCnt"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, CurrFieldOrderCnt) - 96usize];
    ["Offset of field: _CUVIDH264PICPARAMS::dpb"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, dpb) - 104usize];
    ["Offset of field: _CUVIDH264PICPARAMS::WeightScale4x4"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, WeightScale4x4) - 552usize];
    ["Offset of field: _CUVIDH264PICPARAMS::WeightScale8x8"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, WeightScale8x8) - 648usize];
    ["Offset of field: _CUVIDH264PICPARAMS::fmo_aso_enable"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, fmo_aso_enable) - 776usize];
    ["Offset of field: _CUVIDH264PICPARAMS::num_slice_groups_minus1"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, num_slice_groups_minus1) - 777usize];
    ["Offset of field: _CUVIDH264PICPARAMS::slice_group_map_type"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, slice_group_map_type) - 778usize];
    ["Offset of field: _CUVIDH264PICPARAMS::pic_init_qs_minus26"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, pic_init_qs_minus26) - 779usize];
    ["Offset of field: _CUVIDH264PICPARAMS::slice_group_change_rate_minus1"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, slice_group_change_rate_minus1) - 780usize];
    ["Offset of field: _CUVIDH264PICPARAMS::fmo"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, fmo) - 784usize];
    ["Offset of field: _CUVIDH264PICPARAMS::Reserved"]
        [::core::mem::offset_of!(_CUVIDH264PICPARAMS, Reserved) - 796usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDMPEG2PICPARAMS"][::core::mem::size_of::<_CUVIDMPEG2PICPARAMS>() - 192usize];
    ["Alignment of _CUVIDMPEG2PICPARAMS"][::core::mem::align_of::<_CUVIDMPEG2PICPARAMS>() - 4usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::ForwardRefIdx"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, ForwardRefIdx) - 0usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::BackwardRefIdx"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, BackwardRefIdx) - 4usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::picture_coding_type"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, picture_coding_type) - 8usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::full_pel_forward_vector"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, full_pel_forward_vector) - 12usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::full_pel_backward_vector"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, full_pel_backward_vector) - 16usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::f_code"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, f_code) - 20usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::intra_dc_precision"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, intra_dc_precision) - 36usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::frame_pred_frame_dct"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, frame_pred_frame_dct) - 40usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::concealment_motion_vectors"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, concealment_motion_vectors) - 44usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::q_scale_type"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, q_scale_type) - 48usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::intra_vlc_format"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, intra_vlc_format) - 52usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::alternate_scan"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, alternate_scan) - 56usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::top_field_first"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, top_field_first) - 60usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::QuantMatrixIntra"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, QuantMatrixIntra) - 64usize];
    ["Offset of field: _CUVIDMPEG2PICPARAMS::QuantMatrixInter"]
        [::core::mem::offset_of!(_CUVIDMPEG2PICPARAMS, QuantMatrixInter) - 128usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDMPEG4PICPARAMS"][::core::mem::size_of::<_CUVIDMPEG4PICPARAMS>() - 220usize];
    ["Alignment of _CUVIDMPEG4PICPARAMS"][::core::mem::align_of::<_CUVIDMPEG4PICPARAMS>() - 4usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::ForwardRefIdx"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, ForwardRefIdx) - 0usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::BackwardRefIdx"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, BackwardRefIdx) - 4usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::video_object_layer_width"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, video_object_layer_width) - 8usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::video_object_layer_height"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, video_object_layer_height) - 12usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::vop_time_increment_bitcount"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, vop_time_increment_bitcount) - 16usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::top_field_first"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, top_field_first) - 20usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::resync_marker_disable"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, resync_marker_disable) - 24usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::quant_type"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, quant_type) - 28usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::quarter_sample"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, quarter_sample) - 32usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::short_video_header"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, short_video_header) - 36usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::divx_flags"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, divx_flags) - 40usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::vop_coding_type"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, vop_coding_type) - 44usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::vop_coded"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, vop_coded) - 48usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::vop_rounding_type"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, vop_rounding_type) - 52usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::alternate_vertical_scan_flag"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, alternate_vertical_scan_flag) - 56usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::interlaced"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, interlaced) - 60usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::vop_fcode_forward"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, vop_fcode_forward) - 64usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::vop_fcode_backward"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, vop_fcode_backward) - 68usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::trd"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, trd) - 72usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::trb"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, trb) - 80usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::QuantMatrixIntra"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, QuantMatrixIntra) - 88usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::QuantMatrixInter"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, QuantMatrixInter) - 152usize];
    ["Offset of field: _CUVIDMPEG4PICPARAMS::gmc_enabled"]
        [::core::mem::offset_of!(_CUVIDMPEG4PICPARAMS, gmc_enabled) - 216usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDVC1PICPARAMS"][::core::mem::size_of::<_CUVIDVC1PICPARAMS>() - 132usize];
    ["Alignment of _CUVIDVC1PICPARAMS"][::core::mem::align_of::<_CUVIDVC1PICPARAMS>() - 4usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::ForwardRefIdx"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, ForwardRefIdx) - 0usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::BackwardRefIdx"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, BackwardRefIdx) - 4usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::FrameWidth"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, FrameWidth) - 8usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::FrameHeight"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, FrameHeight) - 12usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::intra_pic_flag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, intra_pic_flag) - 16usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::ref_pic_flag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, ref_pic_flag) - 20usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::progressive_fcm"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, progressive_fcm) - 24usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::profile"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, profile) - 28usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::postprocflag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, postprocflag) - 32usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::pulldown"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, pulldown) - 36usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::interlace"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, interlace) - 40usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::tfcntrflag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, tfcntrflag) - 44usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::finterpflag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, finterpflag) - 48usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::psf"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, psf) - 52usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::multires"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, multires) - 56usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::syncmarker"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, syncmarker) - 60usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::rangered"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, rangered) - 64usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::maxbframes"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, maxbframes) - 68usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::panscan_flag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, panscan_flag) - 72usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::refdist_flag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, refdist_flag) - 76usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::extended_mv"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, extended_mv) - 80usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::dquant"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, dquant) - 84usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::vstransform"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, vstransform) - 88usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::loopfilter"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, loopfilter) - 92usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::fastuvmc"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, fastuvmc) - 96usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::overlap"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, overlap) - 100usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::quantizer"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, quantizer) - 104usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::extended_dmv"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, extended_dmv) - 108usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::range_mapy_flag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, range_mapy_flag) - 112usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::range_mapy"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, range_mapy) - 116usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::range_mapuv_flag"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, range_mapuv_flag) - 120usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::range_mapuv"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, range_mapuv) - 124usize];
    ["Offset of field: _CUVIDVC1PICPARAMS::rangeredfrm"]
        [::core::mem::offset_of!(_CUVIDVC1PICPARAMS, rangeredfrm) - 128usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDJPEGPICPARAMS"][::core::mem::size_of::<_CUVIDJPEGPICPARAMS>() - 2736usize];
    ["Alignment of _CUVIDJPEGPICPARAMS"][::core::mem::align_of::<_CUVIDJPEGPICPARAMS>() - 4usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::numComponents"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, numComponents) - 0usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::bitDepth"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, bitDepth) - 1usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::quantizationTableSelector"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, quantizationTableSelector) - 2usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::scanOffset"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, scanOffset) - 8usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::scanSize"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, scanSize) - 24usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::restartInterval"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, restartInterval) - 40usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::componentIdentifier"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, componentIdentifier) - 42usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::hasQMatrix"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, hasQMatrix) - 46usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::hasHuffman"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, hasHuffman) - 47usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::quantvals"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, quantvals) - 48usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::bits_ac"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, bits_ac) - 560usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::table_ac"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, table_ac) - 624usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::bits_dc"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, bits_dc) - 1648usize];
    ["Offset of field: _CUVIDJPEGPICPARAMS::table_dc"]
        [::core::mem::offset_of!(_CUVIDJPEGPICPARAMS, table_dc) - 1712usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDHEVCPICPARAMS"][::core::mem::size_of::<_CUVIDHEVCPICPARAMS>() - 1484usize];
    ["Alignment of _CUVIDHEVCPICPARAMS"][::core::mem::align_of::<_CUVIDHEVCPICPARAMS>() - 4usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pic_width_in_luma_samples"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pic_width_in_luma_samples) - 0usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pic_height_in_luma_samples"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pic_height_in_luma_samples) - 4usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_min_luma_coding_block_size_minus3"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        log2_min_luma_coding_block_size_minus3
    ) - 8usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_diff_max_min_luma_coding_block_size"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        log2_diff_max_min_luma_coding_block_size
    ) - 9usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_min_transform_block_size_minus2"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        log2_min_transform_block_size_minus2
    ) - 10usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_diff_max_min_transform_block_size"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        log2_diff_max_min_transform_block_size
    ) - 11usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pcm_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pcm_enabled_flag) - 12usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_min_pcm_luma_coding_block_size_minus3"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        log2_min_pcm_luma_coding_block_size_minus3
    )
        - 13usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_diff_max_min_pcm_luma_coding_block_size"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        log2_diff_max_min_pcm_luma_coding_block_size
    )
        - 14usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pcm_sample_bit_depth_luma_minus1"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pcm_sample_bit_depth_luma_minus1) - 15usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pcm_sample_bit_depth_chroma_minus1"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        pcm_sample_bit_depth_chroma_minus1
    ) - 16usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pcm_loop_filter_disabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pcm_loop_filter_disabled_flag) - 17usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::strong_intra_smoothing_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        strong_intra_smoothing_enabled_flag
    ) - 18usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::max_transform_hierarchy_depth_intra"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        max_transform_hierarchy_depth_intra
    ) - 19usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::max_transform_hierarchy_depth_inter"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        max_transform_hierarchy_depth_inter
    ) - 20usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::amp_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, amp_enabled_flag) - 21usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::separate_colour_plane_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, separate_colour_plane_flag) - 22usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_max_pic_order_cnt_lsb_minus4"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, log2_max_pic_order_cnt_lsb_minus4) - 23usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::num_short_term_ref_pic_sets"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, num_short_term_ref_pic_sets) - 24usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::long_term_ref_pics_present_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, long_term_ref_pics_present_flag) - 25usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::num_long_term_ref_pics_sps"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, num_long_term_ref_pics_sps) - 26usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::sps_temporal_mvp_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, sps_temporal_mvp_enabled_flag) - 27usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::sample_adaptive_offset_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        sample_adaptive_offset_enabled_flag
    ) - 28usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::scaling_list_enable_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, scaling_list_enable_flag) - 29usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::IrapPicFlag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, IrapPicFlag) - 30usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::IdrPicFlag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, IdrPicFlag) - 31usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::bit_depth_luma_minus8"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, bit_depth_luma_minus8) - 32usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::bit_depth_chroma_minus8"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, bit_depth_chroma_minus8) - 33usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_max_transform_skip_block_size_minus2"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        log2_max_transform_skip_block_size_minus2
    )
        - 34usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_sao_offset_scale_luma"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, log2_sao_offset_scale_luma) - 35usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_sao_offset_scale_chroma"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, log2_sao_offset_scale_chroma) - 36usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::high_precision_offsets_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        high_precision_offsets_enabled_flag
    ) - 37usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::reserved1"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, reserved1) - 38usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::dependent_slice_segments_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        dependent_slice_segments_enabled_flag
    ) - 48usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::slice_segment_header_extension_present_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        slice_segment_header_extension_present_flag
    )
        - 49usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::sign_data_hiding_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, sign_data_hiding_enabled_flag) - 50usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::cu_qp_delta_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, cu_qp_delta_enabled_flag) - 51usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::diff_cu_qp_delta_depth"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, diff_cu_qp_delta_depth) - 52usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::init_qp_minus26"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, init_qp_minus26) - 53usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pps_cb_qp_offset"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pps_cb_qp_offset) - 54usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pps_cr_qp_offset"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pps_cr_qp_offset) - 55usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::constrained_intra_pred_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, constrained_intra_pred_flag) - 56usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::weighted_pred_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, weighted_pred_flag) - 57usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::weighted_bipred_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, weighted_bipred_flag) - 58usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::transform_skip_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, transform_skip_enabled_flag) - 59usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::transquant_bypass_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, transquant_bypass_enabled_flag) - 60usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::entropy_coding_sync_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, entropy_coding_sync_enabled_flag) - 61usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::log2_parallel_merge_level_minus2"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, log2_parallel_merge_level_minus2) - 62usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::num_extra_slice_header_bits"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, num_extra_slice_header_bits) - 63usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::loop_filter_across_tiles_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        loop_filter_across_tiles_enabled_flag
    ) - 64usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::loop_filter_across_slices_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        loop_filter_across_slices_enabled_flag
    ) - 65usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::output_flag_present_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, output_flag_present_flag) - 66usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::num_ref_idx_l0_default_active_minus1"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        num_ref_idx_l0_default_active_minus1
    ) - 67usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::num_ref_idx_l1_default_active_minus1"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        num_ref_idx_l1_default_active_minus1
    ) - 68usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::lists_modification_present_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, lists_modification_present_flag) - 69usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::cabac_init_present_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, cabac_init_present_flag) - 70usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pps_slice_chroma_qp_offsets_present_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        pps_slice_chroma_qp_offsets_present_flag
    ) - 71usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::deblocking_filter_override_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        deblocking_filter_override_enabled_flag
    ) - 72usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pps_deblocking_filter_disabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        pps_deblocking_filter_disabled_flag
    ) - 73usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pps_beta_offset_div2"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pps_beta_offset_div2) - 74usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pps_tc_offset_div2"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pps_tc_offset_div2) - 75usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::tiles_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, tiles_enabled_flag) - 76usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::uniform_spacing_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, uniform_spacing_flag) - 77usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::num_tile_columns_minus1"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, num_tile_columns_minus1) - 78usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::num_tile_rows_minus1"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, num_tile_rows_minus1) - 79usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::column_width_minus1"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, column_width_minus1) - 80usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::row_height_minus1"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, row_height_minus1) - 122usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::sps_range_extension_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, sps_range_extension_flag) - 164usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::transform_skip_rotation_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        transform_skip_rotation_enabled_flag
    ) - 165usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::transform_skip_context_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        transform_skip_context_enabled_flag
    ) - 166usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::implicit_rdpcm_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, implicit_rdpcm_enabled_flag) - 167usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::explicit_rdpcm_enabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, explicit_rdpcm_enabled_flag) - 168usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::extended_precision_processing_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        extended_precision_processing_flag
    ) - 169usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::intra_smoothing_disabled_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, intra_smoothing_disabled_flag) - 170usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::persistent_rice_adaptation_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        persistent_rice_adaptation_enabled_flag
    ) - 171usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::cabac_bypass_alignment_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        cabac_bypass_alignment_enabled_flag
    ) - 172usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::pps_range_extension_flag"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, pps_range_extension_flag) - 173usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::cross_component_prediction_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        cross_component_prediction_enabled_flag
    ) - 174usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::chroma_qp_offset_list_enabled_flag"][::core::mem::offset_of!(
        _CUVIDHEVCPICPARAMS,
        chroma_qp_offset_list_enabled_flag
    ) - 175usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::diff_cu_chroma_qp_offset_depth"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, diff_cu_chroma_qp_offset_depth) - 176usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::chroma_qp_offset_list_len_minus1"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, chroma_qp_offset_list_len_minus1) - 177usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::cb_qp_offset_list"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, cb_qp_offset_list) - 178usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::cr_qp_offset_list"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, cr_qp_offset_list) - 184usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::reserved2"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, reserved2) - 190usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::reserved3"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, reserved3) - 192usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::NumBitsForShortTermRPSInSlice"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, NumBitsForShortTermRPSInSlice) - 224usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::NumDeltaPocsOfRefRpsIdx"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, NumDeltaPocsOfRefRpsIdx) - 228usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::NumPocTotalCurr"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, NumPocTotalCurr) - 232usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::NumPocStCurrBefore"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, NumPocStCurrBefore) - 236usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::NumPocStCurrAfter"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, NumPocStCurrAfter) - 240usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::NumPocLtCurr"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, NumPocLtCurr) - 244usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::CurrPicOrderCntVal"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, CurrPicOrderCntVal) - 248usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::RefPicIdx"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, RefPicIdx) - 252usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::PicOrderCntVal"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, PicOrderCntVal) - 316usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::IsLongTerm"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, IsLongTerm) - 380usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::RefPicSetStCurrBefore"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, RefPicSetStCurrBefore) - 396usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::RefPicSetStCurrAfter"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, RefPicSetStCurrAfter) - 404usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::RefPicSetLtCurr"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, RefPicSetLtCurr) - 412usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::RefPicSetInterLayer0"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, RefPicSetInterLayer0) - 420usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::RefPicSetInterLayer1"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, RefPicSetInterLayer1) - 428usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::reserved4"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, reserved4) - 436usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::ScalingList4x4"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, ScalingList4x4) - 484usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::ScalingList8x8"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, ScalingList8x8) - 580usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::ScalingList16x16"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, ScalingList16x16) - 964usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::ScalingList32x32"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, ScalingList32x32) - 1348usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::ScalingListDCCoeff16x16"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, ScalingListDCCoeff16x16) - 1476usize];
    ["Offset of field: _CUVIDHEVCPICPARAMS::ScalingListDCCoeff32x32"]
        [::core::mem::offset_of!(_CUVIDHEVCPICPARAMS, ScalingListDCCoeff32x32) - 1482usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDVP8PICPARAMS__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_CUVIDVP8PICPARAMS__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Alignment of _CUVIDVP8PICPARAMS__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_CUVIDVP8PICPARAMS__bindgen_ty_1__bindgen_ty_1>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDVP8PICPARAMS__bindgen_ty_1"]
        [::core::mem::size_of::<_CUVIDVP8PICPARAMS__bindgen_ty_1>() - 1usize];
    ["Alignment of _CUVIDVP8PICPARAMS__bindgen_ty_1"]
        [::core::mem::align_of::<_CUVIDVP8PICPARAMS__bindgen_ty_1>() - 1usize];
    ["Offset of field: _CUVIDVP8PICPARAMS__bindgen_ty_1::vp8_frame_tag"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS__bindgen_ty_1, vp8_frame_tag) - 0usize];
    ["Offset of field: _CUVIDVP8PICPARAMS__bindgen_ty_1::wFrameTagFlags"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS__bindgen_ty_1, wFrameTagFlags) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDVP8PICPARAMS"][::core::mem::size_of::<_CUVIDVP8PICPARAMS>() - 32usize];
    ["Alignment of _CUVIDVP8PICPARAMS"][::core::mem::align_of::<_CUVIDVP8PICPARAMS>() - 4usize];
    ["Offset of field: _CUVIDVP8PICPARAMS::width"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS, width) - 0usize];
    ["Offset of field: _CUVIDVP8PICPARAMS::height"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS, height) - 4usize];
    ["Offset of field: _CUVIDVP8PICPARAMS::first_partition_size"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS, first_partition_size) - 8usize];
    ["Offset of field: _CUVIDVP8PICPARAMS::LastRefIdx"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS, LastRefIdx) - 12usize];
    ["Offset of field: _CUVIDVP8PICPARAMS::GoldenRefIdx"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS, GoldenRefIdx) - 13usize];
    ["Offset of field: _CUVIDVP8PICPARAMS::AltRefIdx"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS, AltRefIdx) - 14usize];
    ["Offset of field: _CUVIDVP8PICPARAMS::Reserved1"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS, Reserved1) - 16usize];
    ["Offset of field: _CUVIDVP8PICPARAMS::Reserved2"]
        [::core::mem::offset_of!(_CUVIDVP8PICPARAMS, Reserved2) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDVP9PICPARAMS"][::core::mem::size_of::<_CUVIDVP9PICPARAMS>() - 220usize];
    ["Alignment of _CUVIDVP9PICPARAMS"][::core::mem::align_of::<_CUVIDVP9PICPARAMS>() - 4usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::width"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, width) - 0usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::height"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, height) - 4usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::LastRefIdx"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, LastRefIdx) - 8usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::GoldenRefIdx"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, GoldenRefIdx) - 9usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::AltRefIdx"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, AltRefIdx) - 10usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::colorSpace"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, colorSpace) - 11usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::reserved16Bits"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, reserved16Bits) - 14usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::refFrameSignBias"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, refFrameSignBias) - 16usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::bitDepthMinus8Luma"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, bitDepthMinus8Luma) - 20usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::bitDepthMinus8Chroma"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, bitDepthMinus8Chroma) - 21usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::loopFilterLevel"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, loopFilterLevel) - 22usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::loopFilterSharpness"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, loopFilterSharpness) - 23usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::modeRefLfEnabled"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, modeRefLfEnabled) - 24usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::log2_tile_columns"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, log2_tile_columns) - 25usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::log2_tile_rows"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, log2_tile_rows) - 26usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::segmentFeatureEnable"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, segmentFeatureEnable) - 28usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::segmentFeatureData"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, segmentFeatureData) - 60usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::mb_segment_tree_probs"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, mb_segment_tree_probs) - 124usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::segment_pred_probs"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, segment_pred_probs) - 131usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::reservedSegment16Bits"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, reservedSegment16Bits) - 134usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::qpYAc"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, qpYAc) - 136usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::qpYDc"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, qpYDc) - 140usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::qpChDc"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, qpChDc) - 144usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::qpChAc"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, qpChAc) - 148usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::activeRefIdx"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, activeRefIdx) - 152usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::resetFrameContext"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, resetFrameContext) - 164usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::mcomp_filter_type"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, mcomp_filter_type) - 168usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::mbRefLfDelta"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, mbRefLfDelta) - 172usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::mbModeLfDelta"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, mbModeLfDelta) - 188usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::frameTagSize"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, frameTagSize) - 196usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::offsetToDctParts"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, offsetToDctParts) - 200usize];
    ["Offset of field: _CUVIDVP9PICPARAMS::reserved128Bits"]
        [::core::mem::offset_of!(_CUVIDVP9PICPARAMS, reserved128Bits) - 204usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDAV1PICPARAMS__bindgen_ty_1"]
        [::core::mem::size_of::<_CUVIDAV1PICPARAMS__bindgen_ty_1>() - 12usize];
    ["Alignment of _CUVIDAV1PICPARAMS__bindgen_ty_1"]
        [::core::mem::align_of::<_CUVIDAV1PICPARAMS__bindgen_ty_1>() - 4usize];
    ["Offset of field: _CUVIDAV1PICPARAMS__bindgen_ty_1::width"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS__bindgen_ty_1, width) - 0usize];
    ["Offset of field: _CUVIDAV1PICPARAMS__bindgen_ty_1::height"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS__bindgen_ty_1, height) - 4usize];
    ["Offset of field: _CUVIDAV1PICPARAMS__bindgen_ty_1::index"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS__bindgen_ty_1, index) - 8usize];
    ["Offset of field: _CUVIDAV1PICPARAMS__bindgen_ty_1::reserved24Bits"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS__bindgen_ty_1, reserved24Bits) - 9usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDAV1PICPARAMS__bindgen_ty_2"]
        [::core::mem::size_of::<_CUVIDAV1PICPARAMS__bindgen_ty_2>() - 28usize];
    ["Alignment of _CUVIDAV1PICPARAMS__bindgen_ty_2"]
        [::core::mem::align_of::<_CUVIDAV1PICPARAMS__bindgen_ty_2>() - 4usize];
    ["Offset of field: _CUVIDAV1PICPARAMS__bindgen_ty_2::reserved24Bits"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS__bindgen_ty_2, reserved24Bits) - 1usize];
    ["Offset of field: _CUVIDAV1PICPARAMS__bindgen_ty_2::wmmat"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS__bindgen_ty_2, wmmat) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDAV1PICPARAMS"][::core::mem::size_of::<_CUVIDAV1PICPARAMS>() - 1024usize];
    ["Alignment of _CUVIDAV1PICPARAMS"][::core::mem::align_of::<_CUVIDAV1PICPARAMS>() - 4usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::width"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, width) - 0usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::height"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, height) - 4usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::frame_offset"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, frame_offset) - 8usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::decodePicIdx"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, decodePicIdx) - 12usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::tile_widths"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, tile_widths) - 28usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::tile_heights"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, tile_heights) - 156usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::cdef_y_strength"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, cdef_y_strength) - 285usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::cdef_uv_strength"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, cdef_uv_strength) - 293usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::base_qindex"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, base_qindex) - 302usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::qp_y_dc_delta_q"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, qp_y_dc_delta_q) - 303usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::qp_u_dc_delta_q"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, qp_u_dc_delta_q) - 304usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::qp_v_dc_delta_q"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, qp_v_dc_delta_q) - 305usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::qp_u_ac_delta_q"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, qp_u_ac_delta_q) - 306usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::qp_v_ac_delta_q"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, qp_v_ac_delta_q) - 307usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::qm_y"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, qm_y) - 308usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::qm_u"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, qm_u) - 309usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::qm_v"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, qm_v) - 310usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::segmentation_feature_data"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, segmentation_feature_data) - 312usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::segmentation_feature_mask"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, segmentation_feature_mask) - 440usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::loop_filter_level"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, loop_filter_level) - 448usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::loop_filter_level_u"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, loop_filter_level_u) - 450usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::loop_filter_level_v"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, loop_filter_level_v) - 451usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::loop_filter_sharpness"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, loop_filter_sharpness) - 452usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::loop_filter_ref_deltas"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, loop_filter_ref_deltas) - 453usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::loop_filter_mode_deltas"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, loop_filter_mode_deltas) - 461usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::lr_unit_size"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, lr_unit_size) - 464usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::lr_type"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, lr_type) - 467usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::primary_ref_frame"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, primary_ref_frame) - 470usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::ref_frame_map"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, ref_frame_map) - 471usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::reserved5_32bits"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, reserved5_32bits) - 480usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::ref_frame"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, ref_frame) - 484usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::global_motion"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, global_motion) - 568usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::num_y_points"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, num_y_points) - 766usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::scaling_points_y"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, scaling_points_y) - 767usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::num_cb_points"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, num_cb_points) - 795usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::scaling_points_cb"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, scaling_points_cb) - 796usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::num_cr_points"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, num_cr_points) - 816usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::scaling_points_cr"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, scaling_points_cr) - 817usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::reserved7_8bits"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, reserved7_8bits) - 837usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::random_seed"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, random_seed) - 838usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::ar_coeffs_y"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, ar_coeffs_y) - 840usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::ar_coeffs_cb"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, ar_coeffs_cb) - 888usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::ar_coeffs_cr"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, ar_coeffs_cr) - 938usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::cb_mult"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, cb_mult) - 988usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::cb_luma_mult"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, cb_luma_mult) - 989usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::cb_offset"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, cb_offset) - 990usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::cr_mult"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, cr_mult) - 992usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::cr_luma_mult"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, cr_luma_mult) - 993usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::cr_offset"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, cr_offset) - 994usize];
    ["Offset of field: _CUVIDAV1PICPARAMS::reserved"]
        [::core::mem::offset_of!(_CUVIDAV1PICPARAMS, reserved) - 996usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDPICPARAMS__bindgen_ty_1"]
        [::core::mem::size_of::<_CUVIDPICPARAMS__bindgen_ty_1>() - 4096usize];
    ["Alignment of _CUVIDPICPARAMS__bindgen_ty_1"]
        [::core::mem::align_of::<_CUVIDPICPARAMS__bindgen_ty_1>() - 8usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::mpeg2"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, mpeg2) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::h264"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, h264) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::vc1"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, vc1) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::mpeg4"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, mpeg4) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::jpeg"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, jpeg) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::hevc"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, hevc) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::vp8"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, vp8) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::vp9"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, vp9) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::av1"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, av1) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS__bindgen_ty_1::CodecReserved"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS__bindgen_ty_1, CodecReserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDPICPARAMS"][::core::mem::size_of::<_CUVIDPICPARAMS>() - 4280usize];
    ["Alignment of _CUVIDPICPARAMS"][::core::mem::align_of::<_CUVIDPICPARAMS>() - 8usize];
    ["Offset of field: _CUVIDPICPARAMS::PicWidthInMbs"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, PicWidthInMbs) - 0usize];
    ["Offset of field: _CUVIDPICPARAMS::FrameHeightInMbs"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, FrameHeightInMbs) - 4usize];
    ["Offset of field: _CUVIDPICPARAMS::CurrPicIdx"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, CurrPicIdx) - 8usize];
    ["Offset of field: _CUVIDPICPARAMS::field_pic_flag"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, field_pic_flag) - 12usize];
    ["Offset of field: _CUVIDPICPARAMS::bottom_field_flag"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, bottom_field_flag) - 16usize];
    ["Offset of field: _CUVIDPICPARAMS::second_field"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, second_field) - 20usize];
    ["Offset of field: _CUVIDPICPARAMS::nBitstreamDataLen"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, nBitstreamDataLen) - 24usize];
    ["Offset of field: _CUVIDPICPARAMS::pBitstreamData"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, pBitstreamData) - 32usize];
    ["Offset of field: _CUVIDPICPARAMS::nNumSlices"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, nNumSlices) - 40usize];
    ["Offset of field: _CUVIDPICPARAMS::pSliceDataOffsets"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, pSliceDataOffsets) - 48usize];
    ["Offset of field: _CUVIDPICPARAMS::ref_pic_flag"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, ref_pic_flag) - 56usize];
    ["Offset of field: _CUVIDPICPARAMS::intra_pic_flag"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, intra_pic_flag) - 60usize];
    ["Offset of field: _CUVIDPICPARAMS::Reserved"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, Reserved) - 64usize];
    ["Offset of field: _CUVIDPICPARAMS::CodecSpecific"]
        [::core::mem::offset_of!(_CUVIDPICPARAMS, CodecSpecific) - 184usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDPROCPARAMS"][::core::mem::size_of::<_CUVIDPROCPARAMS>() - 264usize];
    ["Alignment of _CUVIDPROCPARAMS"][::core::mem::align_of::<_CUVIDPROCPARAMS>() - 8usize];
    ["Offset of field: _CUVIDPROCPARAMS::progressive_frame"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, progressive_frame) - 0usize];
    ["Offset of field: _CUVIDPROCPARAMS::second_field"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, second_field) - 4usize];
    ["Offset of field: _CUVIDPROCPARAMS::top_field_first"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, top_field_first) - 8usize];
    ["Offset of field: _CUVIDPROCPARAMS::unpaired_field"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, unpaired_field) - 12usize];
    ["Offset of field: _CUVIDPROCPARAMS::reserved_flags"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, reserved_flags) - 16usize];
    ["Offset of field: _CUVIDPROCPARAMS::reserved_zero"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, reserved_zero) - 20usize];
    ["Offset of field: _CUVIDPROCPARAMS::raw_input_dptr"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, raw_input_dptr) - 24usize];
    ["Offset of field: _CUVIDPROCPARAMS::raw_input_pitch"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, raw_input_pitch) - 32usize];
    ["Offset of field: _CUVIDPROCPARAMS::raw_input_format"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, raw_input_format) - 36usize];
    ["Offset of field: _CUVIDPROCPARAMS::raw_output_dptr"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, raw_output_dptr) - 40usize];
    ["Offset of field: _CUVIDPROCPARAMS::raw_output_pitch"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, raw_output_pitch) - 48usize];
    ["Offset of field: _CUVIDPROCPARAMS::Reserved1"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, Reserved1) - 52usize];
    ["Offset of field: _CUVIDPROCPARAMS::output_stream"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, output_stream) - 56usize];
    ["Offset of field: _CUVIDPROCPARAMS::Reserved"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, Reserved) - 64usize];
    ["Offset of field: _CUVIDPROCPARAMS::histogram_dptr"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, histogram_dptr) - 248usize];
    ["Offset of field: _CUVIDPROCPARAMS::Reserved2"]
        [::core::mem::offset_of!(_CUVIDPROCPARAMS, Reserved2) - 256usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDGETDECODESTATUS"][::core::mem::size_of::<_CUVIDGETDECODESTATUS>() - 192usize];
    ["Alignment of _CUVIDGETDECODESTATUS"]
        [::core::mem::align_of::<_CUVIDGETDECODESTATUS>() - 8usize];
    ["Offset of field: _CUVIDGETDECODESTATUS::decodeStatus"]
        [::core::mem::offset_of!(_CUVIDGETDECODESTATUS, decodeStatus) - 0usize];
    ["Offset of field: _CUVIDGETDECODESTATUS::reserved"]
        [::core::mem::offset_of!(_CUVIDGETDECODESTATUS, reserved) - 4usize];
    ["Offset of field: _CUVIDGETDECODESTATUS::pReserved"]
        [::core::mem::offset_of!(_CUVIDGETDECODESTATUS, pReserved) - 128usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1"]
        [::core::mem::size_of::<_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1>() - 8usize];
    ["Alignment of _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1"]
        [::core::mem::align_of::<_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1>() - 2usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1::left"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1, left) - 0usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1::top"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1, top) - 2usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1::right"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1, right) - 4usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1::bottom"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_1, bottom) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2"]
        [::core::mem::size_of::<_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2>() - 8usize];
    ["Alignment of _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2"]
        [::core::mem::align_of::<_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2>() - 2usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2::left"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2, left) - 0usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2::top"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2, top) - 2usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2::right"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2, right) - 4usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2::bottom"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO__bindgen_ty_2, bottom) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CUVIDRECONFIGUREDECODERINFO"]
        [::core::mem::size_of::<_CUVIDRECONFIGUREDECODERINFO>() - 128usize];
    ["Alignment of _CUVIDRECONFIGUREDECODERINFO"]
        [::core::mem::align_of::<_CUVIDRECONFIGUREDECODERINFO>() - 4usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::ulWidth"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, ulWidth) - 0usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::ulHeight"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, ulHeight) - 4usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::ulTargetWidth"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, ulTargetWidth) - 8usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::ulTargetHeight"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, ulTargetHeight) - 12usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::ulNumDecodeSurfaces"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, ulNumDecodeSurfaces) - 16usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::reserved1"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, reserved1) - 20usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::display_area"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, display_area) - 68usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::target_rect"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, target_rect) - 76usize];
    ["Offset of field: _CUVIDRECONFIGUREDECODERINFO::reserved2"]
        [::core::mem::offset_of!(_CUVIDRECONFIGUREDECODERINFO, reserved2) - 84usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cudaVideoCodec_enum {
    cudaVideoCodec_MPEG1 = 0,
    cudaVideoCodec_MPEG2 = 1,
    cudaVideoCodec_MPEG4 = 2,
    cudaVideoCodec_VC1 = 3,
    cudaVideoCodec_H264 = 4,
    cudaVideoCodec_JPEG = 5,
    cudaVideoCodec_H264_SVC = 6,
    cudaVideoCodec_H264_MVC = 7,
    cudaVideoCodec_HEVC = 8,
    cudaVideoCodec_VP8 = 9,
    cudaVideoCodec_VP9 = 10,
    cudaVideoCodec_AV1 = 11,
    cudaVideoCodec_NumCodecs = 12,
    cudaVideoCodec_YUV420 = 1230591318,
    cudaVideoCodec_YV12 = 1498820914,
    cudaVideoCodec_NV12 = 1314271538,
    cudaVideoCodec_YUYV = 1498765654,
    cudaVideoCodec_UYVY = 1431918169,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum cudaVideoSurfaceFormat_enum {
