pub use super::super::version::*;
pub use super::super::guid::*;
/* automatically generated by rust-bindgen 0.71.1 */

pub type GUID = _GUID;
pub type NVENC_RECT = _NVENC_RECT;
pub type NV_ENC_INPUT_PTR = *mut ::core::ffi::c_void;
pub type NV_ENC_OUTPUT_PTR = *mut ::core::ffi::c_void;
pub type NV_ENC_REGISTERED_PTR = *mut ::core::ffi::c_void;
pub type NV_ENC_CUSTREAM_PTR = *mut ::core::ffi::c_void;
pub type NV_ENC_CAPS_PARAM = _NV_ENC_CAPS_PARAM;
pub type NV_ENC_RESTORE_ENCODER_STATE_PARAMS = _NV_ENC_RESTORE_ENCODER_STATE_PARAMS;
pub type NV_ENC_OUTPUT_STATS_BLOCK = _NV_ENC_OUTPUT_STATS_BLOCK;
pub type NV_ENC_OUTPUT_STATS_ROW = _NV_ENC_OUTPUT_STATS_ROW;
pub type NV_ENC_ENCODE_OUT_PARAMS = _NV_ENC_ENCODE_OUT_PARAMS;
pub type NV_ENC_LOOKAHEAD_PIC_PARAMS = _NV_ENC_LOOKAHEAD_PIC_PARAMS;
pub type NV_ENC_CREATE_INPUT_BUFFER = _NV_ENC_CREATE_INPUT_BUFFER;
pub type NV_ENC_CREATE_BITSTREAM_BUFFER = _NV_ENC_CREATE_BITSTREAM_BUFFER;
pub type NV_ENC_MVECTOR = _NV_ENC_MVECTOR;
pub type NV_ENC_H264_MV_DATA = _NV_ENC_H264_MV_DATA;
pub type NV_ENC_HEVC_MV_DATA = _NV_ENC_HEVC_MV_DATA;
pub type NV_ENC_CREATE_MV_BUFFER = _NV_ENC_CREATE_MV_BUFFER;
pub type NV_ENC_QP = _NV_ENC_QP;
pub type NV_ENC_RC_PARAMS = _NV_ENC_RC_PARAMS;
pub type NV_ENC_CLOCK_TIMESTAMP_SET = _NV_ENC_CLOCK_TIMESTAMP_SET;
pub type NV_ENC_TIME_CODE = _NV_ENC_TIME_CODE;
pub type HEVC_3D_REFERENCE_DISPLAY_INFO = _HEVC_3D_REFERENCE_DISPLAY_INFO;
pub type CHROMA_POINTS = _CHROMA_POINTS;

pub struct _NV_ENCODE_API_FUNCTION_LIST {
    pub version: u32,
    pub reserved: u32,
    pub nvEncOpenEncodeSession: PNVENCOPENENCODESESSION,
    pub nvEncGetEncodeGUIDCount: PNVENCGETENCODEGUIDCOUNT,
    pub nvEncGetEncodeProfileGUIDCount: PNVENCGETENCODEPROFILEGUIDCOUNT,
    pub nvEncGetEncodeProfileGUIDs: PNVENCGETENCODEPROFILEGUIDS,
    pub nvEncGetEncodeGUIDs: PNVENCGETENCODEGUIDS,
    pub nvEncGetInputFormatCount: PNVENCGETINPUTFORMATCOUNT,
    pub nvEncGetInputFormats: PNVENCGETINPUTFORMATS,
    pub nvEncGetEncodeCaps: PNVENCGETENCODECAPS,
    pub nvEncGetEncodePresetCount: PNVENCGETENCODEPRESETCOUNT,
    pub nvEncGetEncodePresetGUIDs: PNVENCGETENCODEPRESETGUIDS,
    pub nvEncGetEncodePresetConfig: PNVENCGETENCODEPRESETCONFIG,
    pub nvEncInitializeEncoder: PNVENCINITIALIZEENCODER,
    pub nvEncCreateInputBuffer: PNVENCCREATEINPUTBUFFER,
    pub nvEncDestroyInputBuffer: PNVENCDESTROYINPUTBUFFER,
    pub nvEncCreateBitstreamBuffer: PNVENCCREATEBITSTREAMBUFFER,
    pub nvEncDestroyBitstreamBuffer: PNVENCDESTROYBITSTREAMBUFFER,
    pub nvEncEncodePicture: PNVENCENCODEPICTURE,
    pub nvEncLockBitstream: PNVENCLOCKBITSTREAM,
    pub nvEncUnlockBitstream: PNVENCUNLOCKBITSTREAM,
    pub nvEncLockInputBuffer: PNVENCLOCKINPUTBUFFER,
    pub nvEncUnlockInputBuffer: PNVENCUNLOCKINPUTBUFFER,
    pub nvEncGetEncodeStats: PNVENCGETENCODESTATS,
    pub nvEncGetSequenceParams: PNVENCGETSEQUENCEPARAMS,
    pub nvEncRegisterAsyncEvent: PNVENCREGISTERASYNCEVENT,
    pub nvEncUnregisterAsyncEvent: PNVENCUNREGISTERASYNCEVENT,
    pub nvEncMapInputResource: PNVENCMAPINPUTRESOURCE,
    pub nvEncUnmapInputResource: PNVENCUNMAPINPUTRESOURCE,
    pub nvEncDestroyEncoder: PNVENCDESTROYENCODER,
    pub nvEncInvalidateRefFrames: PNVENCINVALIDATEREFFRAMES,
    pub nvEncOpenEncodeSessionEx: PNVENCOPENENCODESESSIONEX,
    pub nvEncRegisterResource: PNVENCREGISTERRESOURCE,
    pub nvEncUnregisterResource: PNVENCUNREGISTERRESOURCE,
    pub nvEncReconfigureEncoder: PNVENCRECONFIGUREENCODER,
    pub reserved1: *mut ::core::ffi::c_void,
    pub nvEncCreateMVBuffer: PNVENCCREATEMVBUFFER,
    pub nvEncDestroyMVBuffer: PNVENCDESTROYMVBUFFER,
    pub nvEncRunMotionEstimationOnly: PNVENCRUNMOTIONESTIMATIONONLY,
    pub nvEncGetLastErrorString: PNVENCGETLASTERROR,
    pub nvEncSetIOCudaStreams: PNVENCSETIOCUDASTREAMS,
    pub nvEncGetEncodePresetConfigEx: PNVENCGETENCODEPRESETCONFIGEX,
    pub nvEncGetSequenceParamEx: PNVENCGETSEQUENCEPARAMEX,
    pub nvEncRestoreEncoderState: PNVENCRESTOREENCODERSTATE,
    pub nvEncLookaheadPicture: PNVENCLOOKAHEADPICTURE,
    pub reserved2: [*mut ::core::ffi::c_void; 275usize],
}
pub const NVENCAPI_MAJOR_VERSION: u32 = 13;
pub const NVENCAPI_MINOR_VERSION: u32 = 0;
pub const NVENCAPI_VERSION: u32 = 13;
pub const NVENC_INFINITE_GOPLENGTH: u32 = 4294967295;
pub const NV_MAX_SEQ_HDR_LEN: u32 = 512;
pub const NV_MAX_TILE_COLS_AV1: u32 = 64;
pub const NV_MAX_TILE_ROWS_AV1: u32 = 64;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GUID"][::core::mem::size_of::<_GUID>() - 16usize];
    ["Alignment of _GUID"][::core::mem::align_of::<_GUID>() - 4usize];
    ["Offset of field: _GUID::Data1"][::core::mem::offset_of!(_GUID, Data1) - 0usize];
    ["Offset of field: _GUID::Data2"][::core::mem::offset_of!(_GUID, Data2) - 4usize];
    ["Offset of field: _GUID::Data3"][::core::mem::offset_of!(_GUID, Data3) - 6usize];
    ["Offset of field: _GUID::Data4"][::core::mem::offset_of!(_GUID, Data4) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NVENC_RECT"][::core::mem::size_of::<_NVENC_RECT>() - 16usize];
    ["Alignment of _NVENC_RECT"][::core::mem::align_of::<_NVENC_RECT>() - 4usize];
    ["Offset of field: _NVENC_RECT::left"][::core::mem::offset_of!(_NVENC_RECT, left) - 0usize];
    ["Offset of field: _NVENC_RECT::top"][::core::mem::offset_of!(_NVENC_RECT, top) - 4usize];
    ["Offset of field: _NVENC_RECT::right"][::core::mem::offset_of!(_NVENC_RECT, right) - 8usize];
    ["Offset of field: _NVENC_RECT::bottom"]
        [::core::mem::offset_of!(_NVENC_RECT, bottom) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CAPS_PARAM"][::core::mem::size_of::<_NV_ENC_CAPS_PARAM>() - 256usize];
    ["Alignment of _NV_ENC_CAPS_PARAM"][::core::mem::align_of::<_NV_ENC_CAPS_PARAM>() - 4usize];
    ["Offset of field: _NV_ENC_CAPS_PARAM::version"]
        [::core::mem::offset_of!(_NV_ENC_CAPS_PARAM, version) - 0usize];
    ["Offset of field: _NV_ENC_CAPS_PARAM::capsToQuery"]
        [::core::mem::offset_of!(_NV_ENC_CAPS_PARAM, capsToQuery) - 4usize];
    ["Offset of field: _NV_ENC_CAPS_PARAM::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CAPS_PARAM, reserved) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_RESTORE_ENCODER_STATE_PARAMS"]
        [::core::mem::size_of::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>() - 800usize];
    ["Alignment of _NV_ENC_RESTORE_ENCODER_STATE_PARAMS"]
        [::core::mem::align_of::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::bufferIdx"]
        [::core::mem::offset_of!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS, bufferIdx) - 4usize];
    ["Offset of field: _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::state"]
        [::core::mem::offset_of!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS, state) - 8usize];
    ["Offset of field: _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS, reserved) - 12usize];
    ["Offset of field: _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::outputBitstream"]
        [::core::mem::offset_of!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS, outputBitstream) - 16usize];
    ["Offset of field: _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::completionEvent"]
        [::core::mem::offset_of!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS, completionEvent) - 24usize];
    ["Offset of field: _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS, reserved1) - 32usize];
    ["Offset of field: _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS, reserved2) - 288usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_OUTPUT_STATS_BLOCK"]
        [::core::mem::size_of::<_NV_ENC_OUTPUT_STATS_BLOCK>() - 64usize];
    ["Alignment of _NV_ENC_OUTPUT_STATS_BLOCK"]
        [::core::mem::align_of::<_NV_ENC_OUTPUT_STATS_BLOCK>() - 4usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_BLOCK::version"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_BLOCK, version) - 0usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_BLOCK::QP"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_BLOCK, QP) - 4usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_BLOCK::reserved"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_BLOCK, reserved) - 5usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_BLOCK::bitcount"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_BLOCK, bitcount) - 8usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_BLOCK::satdCost"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_BLOCK, satdCost) - 12usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_BLOCK::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_BLOCK, reserved1) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_OUTPUT_STATS_ROW"]
        [::core::mem::size_of::<_NV_ENC_OUTPUT_STATS_ROW>() - 64usize];
    ["Alignment of _NV_ENC_OUTPUT_STATS_ROW"]
        [::core::mem::align_of::<_NV_ENC_OUTPUT_STATS_ROW>() - 4usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_ROW::version"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_ROW, version) - 0usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_ROW::QP"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_ROW, QP) - 4usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_ROW::reserved"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_ROW, reserved) - 5usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_ROW::bitcount"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_ROW, bitcount) - 8usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_ROW::satdCost"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_ROW, satdCost) - 12usize];
    ["Offset of field: _NV_ENC_OUTPUT_STATS_ROW::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_STATS_ROW, reserved1) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_ENCODE_OUT_PARAMS"]
        [::core::mem::size_of::<_NV_ENC_ENCODE_OUT_PARAMS>() - 256usize];
    ["Alignment of _NV_ENC_ENCODE_OUT_PARAMS"]
        [::core::mem::align_of::<_NV_ENC_ENCODE_OUT_PARAMS>() - 4usize];
    ["Offset of field: _NV_ENC_ENCODE_OUT_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_ENCODE_OUT_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_ENCODE_OUT_PARAMS::bitstreamSizeInBytes"]
        [::core::mem::offset_of!(_NV_ENC_ENCODE_OUT_PARAMS, bitstreamSizeInBytes) - 4usize];
    ["Offset of field: _NV_ENC_ENCODE_OUT_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_ENCODE_OUT_PARAMS, reserved) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_LOOKAHEAD_PIC_PARAMS"]
        [::core::mem::size_of::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>() - 784usize];
    ["Alignment of _NV_ENC_LOOKAHEAD_PIC_PARAMS"]
        [::core::mem::align_of::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_LOOKAHEAD_PIC_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_LOOKAHEAD_PIC_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_LOOKAHEAD_PIC_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_LOOKAHEAD_PIC_PARAMS, reserved) - 4usize];
    ["Offset of field: _NV_ENC_LOOKAHEAD_PIC_PARAMS::inputBuffer"]
        [::core::mem::offset_of!(_NV_ENC_LOOKAHEAD_PIC_PARAMS, inputBuffer) - 8usize];
    ["Offset of field: _NV_ENC_LOOKAHEAD_PIC_PARAMS::pictureType"]
        [::core::mem::offset_of!(_NV_ENC_LOOKAHEAD_PIC_PARAMS, pictureType) - 16usize];
    ["Offset of field: _NV_ENC_LOOKAHEAD_PIC_PARAMS::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_LOOKAHEAD_PIC_PARAMS, reserved1) - 20usize];
    ["Offset of field: _NV_ENC_LOOKAHEAD_PIC_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_LOOKAHEAD_PIC_PARAMS, reserved2) - 272usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CREATE_INPUT_BUFFER"]
        [::core::mem::size_of::<_NV_ENC_CREATE_INPUT_BUFFER>() - 776usize];
    ["Alignment of _NV_ENC_CREATE_INPUT_BUFFER"]
        [::core::mem::align_of::<_NV_ENC_CREATE_INPUT_BUFFER>() - 8usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::version"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, version) - 0usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::width"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, width) - 4usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::height"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, height) - 8usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::memoryHeap"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, memoryHeap) - 12usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::bufferFmt"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, bufferFmt) - 16usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, reserved) - 20usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::inputBuffer"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, inputBuffer) - 24usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::pSysMemBuffer"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, pSysMemBuffer) - 32usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, reserved1) - 40usize];
    ["Offset of field: _NV_ENC_CREATE_INPUT_BUFFER::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_INPUT_BUFFER, reserved2) - 272usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CREATE_BITSTREAM_BUFFER"]
        [::core::mem::size_of::<_NV_ENC_CREATE_BITSTREAM_BUFFER>() - 776usize];
    ["Alignment of _NV_ENC_CREATE_BITSTREAM_BUFFER"]
        [::core::mem::align_of::<_NV_ENC_CREATE_BITSTREAM_BUFFER>() - 8usize];
    ["Offset of field: _NV_ENC_CREATE_BITSTREAM_BUFFER::version"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_BITSTREAM_BUFFER, version) - 0usize];
    ["Offset of field: _NV_ENC_CREATE_BITSTREAM_BUFFER::size"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_BITSTREAM_BUFFER, size) - 4usize];
    ["Offset of field: _NV_ENC_CREATE_BITSTREAM_BUFFER::memoryHeap"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_BITSTREAM_BUFFER, memoryHeap) - 8usize];
    ["Offset of field: _NV_ENC_CREATE_BITSTREAM_BUFFER::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_BITSTREAM_BUFFER, reserved) - 12usize];
    ["Offset of field: _NV_ENC_CREATE_BITSTREAM_BUFFER::bitstreamBuffer"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_BITSTREAM_BUFFER, bitstreamBuffer) - 16usize];
    ["Offset of field: _NV_ENC_CREATE_BITSTREAM_BUFFER::bitstreamBufferPtr"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_BITSTREAM_BUFFER, bitstreamBufferPtr) - 24usize];
    ["Offset of field: _NV_ENC_CREATE_BITSTREAM_BUFFER::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_BITSTREAM_BUFFER, reserved1) - 32usize];
    ["Offset of field: _NV_ENC_CREATE_BITSTREAM_BUFFER::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_BITSTREAM_BUFFER, reserved2) - 264usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_MVECTOR"][::core::mem::size_of::<_NV_ENC_MVECTOR>() - 4usize];
    ["Alignment of _NV_ENC_MVECTOR"][::core::mem::align_of::<_NV_ENC_MVECTOR>() - 2usize];
    ["Offset of field: _NV_ENC_MVECTOR::mvx"]
        [::core::mem::offset_of!(_NV_ENC_MVECTOR, mvx) - 0usize];
    ["Offset of field: _NV_ENC_MVECTOR::mvy"]
        [::core::mem::offset_of!(_NV_ENC_MVECTOR, mvy) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_H264_MV_DATA"][::core::mem::size_of::<_NV_ENC_H264_MV_DATA>() - 24usize];
    ["Alignment of _NV_ENC_H264_MV_DATA"][::core::mem::align_of::<_NV_ENC_H264_MV_DATA>() - 4usize];
    ["Offset of field: _NV_ENC_H264_MV_DATA::mv"]
        [::core::mem::offset_of!(_NV_ENC_H264_MV_DATA, mv) - 0usize];
    ["Offset of field: _NV_ENC_H264_MV_DATA::mbType"]
        [::core::mem::offset_of!(_NV_ENC_H264_MV_DATA, mbType) - 16usize];
    ["Offset of field: _NV_ENC_H264_MV_DATA::partitionType"]
        [::core::mem::offset_of!(_NV_ENC_H264_MV_DATA, partitionType) - 17usize];
    ["Offset of field: _NV_ENC_H264_MV_DATA::reserved"]
        [::core::mem::offset_of!(_NV_ENC_H264_MV_DATA, reserved) - 18usize];
    ["Offset of field: _NV_ENC_H264_MV_DATA::mbCost"]
        [::core::mem::offset_of!(_NV_ENC_H264_MV_DATA, mbCost) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_HEVC_MV_DATA"][::core::mem::size_of::<_NV_ENC_HEVC_MV_DATA>() - 20usize];
    ["Alignment of _NV_ENC_HEVC_MV_DATA"][::core::mem::align_of::<_NV_ENC_HEVC_MV_DATA>() - 2usize];
    ["Offset of field: _NV_ENC_HEVC_MV_DATA::mv"]
        [::core::mem::offset_of!(_NV_ENC_HEVC_MV_DATA, mv) - 0usize];
    ["Offset of field: _NV_ENC_HEVC_MV_DATA::cuType"]
        [::core::mem::offset_of!(_NV_ENC_HEVC_MV_DATA, cuType) - 16usize];
    ["Offset of field: _NV_ENC_HEVC_MV_DATA::cuSize"]
        [::core::mem::offset_of!(_NV_ENC_HEVC_MV_DATA, cuSize) - 17usize];
    ["Offset of field: _NV_ENC_HEVC_MV_DATA::partitionMode"]
        [::core::mem::offset_of!(_NV_ENC_HEVC_MV_DATA, partitionMode) - 18usize];
    ["Offset of field: _NV_ENC_HEVC_MV_DATA::lastCUInCTB"]
        [::core::mem::offset_of!(_NV_ENC_HEVC_MV_DATA, lastCUInCTB) - 19usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CREATE_MV_BUFFER"]
        [::core::mem::size_of::<_NV_ENC_CREATE_MV_BUFFER>() - 1536usize];
    ["Alignment of _NV_ENC_CREATE_MV_BUFFER"]
        [::core::mem::align_of::<_NV_ENC_CREATE_MV_BUFFER>() - 8usize];
    ["Offset of field: _NV_ENC_CREATE_MV_BUFFER::version"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_MV_BUFFER, version) - 0usize];
    ["Offset of field: _NV_ENC_CREATE_MV_BUFFER::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_MV_BUFFER, reserved) - 4usize];
    ["Offset of field: _NV_ENC_CREATE_MV_BUFFER::mvBuffer"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_MV_BUFFER, mvBuffer) - 8usize];
    ["Offset of field: _NV_ENC_CREATE_MV_BUFFER::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_MV_BUFFER, reserved1) - 16usize];
    ["Offset of field: _NV_ENC_CREATE_MV_BUFFER::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_CREATE_MV_BUFFER, reserved2) - 1032usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_QP"][::core::mem::size_of::<_NV_ENC_QP>() - 12usize];
    ["Alignment of _NV_ENC_QP"][::core::mem::align_of::<_NV_ENC_QP>() - 4usize];
    ["Offset of field: _NV_ENC_QP::qpInterP"]
        [::core::mem::offset_of!(_NV_ENC_QP, qpInterP) - 0usize];
    ["Offset of field: _NV_ENC_QP::qpInterB"]
        [::core::mem::offset_of!(_NV_ENC_QP, qpInterB) - 4usize];
    ["Offset of field: _NV_ENC_QP::qpIntra"][::core::mem::offset_of!(_NV_ENC_QP, qpIntra) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_RC_PARAMS"][::core::mem::size_of::<_NV_ENC_RC_PARAMS>() - 128usize];
    ["Alignment of _NV_ENC_RC_PARAMS"][::core::mem::align_of::<_NV_ENC_RC_PARAMS>() - 4usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::rateControlMode"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, rateControlMode) - 4usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::constQP"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, constQP) - 8usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::averageBitRate"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, averageBitRate) - 20usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::maxBitRate"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, maxBitRate) - 24usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::vbvBufferSize"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, vbvBufferSize) - 28usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::vbvInitialDelay"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, vbvInitialDelay) - 32usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::minQP"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, minQP) - 40usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::maxQP"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, maxQP) - 52usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::initialRCQP"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, initialRCQP) - 64usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::temporallayerIdxMask"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, temporallayerIdxMask) - 76usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::temporalLayerQP"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, temporalLayerQP) - 80usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::targetQuality"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, targetQuality) - 88usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::targetQualityLSB"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, targetQualityLSB) - 89usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::lookaheadDepth"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, lookaheadDepth) - 90usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::lowDelayKeyFrameScale"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, lowDelayKeyFrameScale) - 92usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::yDcQPIndexOffset"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, yDcQPIndexOffset) - 93usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::uDcQPIndexOffset"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, uDcQPIndexOffset) - 94usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::vDcQPIndexOffset"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, vDcQPIndexOffset) - 95usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::qpMapMode"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, qpMapMode) - 96usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::multiPass"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, multiPass) - 100usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::alphaLayerBitrateRatio"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, alphaLayerBitrateRatio) - 104usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::cbQPIndexOffset"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, cbQPIndexOffset) - 108usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::crQPIndexOffset"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, crQPIndexOffset) - 109usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, reserved2) - 110usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::lookaheadLevel"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, lookaheadLevel) - 112usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::viewBitrateRatios"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, viewBitrateRatios) - 116usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::reserved3"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, reserved3) - 123usize];
    ["Offset of field: _NV_ENC_RC_PARAMS::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_RC_PARAMS, reserved1) - 124usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CLOCK_TIMESTAMP_SET"]
        [::core::mem::size_of::<_NV_ENC_CLOCK_TIMESTAMP_SET>() - 8usize];
    ["Alignment of _NV_ENC_CLOCK_TIMESTAMP_SET"]
        [::core::mem::align_of::<_NV_ENC_CLOCK_TIMESTAMP_SET>() - 4usize];
    ["Offset of field: _NV_ENC_CLOCK_TIMESTAMP_SET::timeOffset"]
        [::core::mem::offset_of!(_NV_ENC_CLOCK_TIMESTAMP_SET, timeOffset) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_TIME_CODE"][::core::mem::size_of::<_NV_ENC_TIME_CODE>() - 32usize];
    ["Alignment of _NV_ENC_TIME_CODE"][::core::mem::align_of::<_NV_ENC_TIME_CODE>() - 4usize];
    ["Offset of field: _NV_ENC_TIME_CODE::displayPicStruct"]
        [::core::mem::offset_of!(_NV_ENC_TIME_CODE, displayPicStruct) - 0usize];
    ["Offset of field: _NV_ENC_TIME_CODE::clockTimestamp"]
        [::core::mem::offset_of!(_NV_ENC_TIME_CODE, clockTimestamp) - 4usize];
    ["Offset of field: _NV_ENC_TIME_CODE::skipClockTimestampInsertion"]
        [::core::mem::offset_of!(_NV_ENC_TIME_CODE, skipClockTimestampInsertion) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _HEVC_3D_REFERENCE_DISPLAY_INFO"]
        [::core::mem::size_of::<_HEVC_3D_REFERENCE_DISPLAY_INFO>() - 960usize];
    ["Alignment of _HEVC_3D_REFERENCE_DISPLAY_INFO"]
        [::core::mem::align_of::<_HEVC_3D_REFERENCE_DISPLAY_INFO>() - 4usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::precRefDisplayWidth"]
        [::core::mem::offset_of!(_HEVC_3D_REFERENCE_DISPLAY_INFO, precRefDisplayWidth) - 4usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::precRefViewingDist"]
        [::core::mem::offset_of!(_HEVC_3D_REFERENCE_DISPLAY_INFO, precRefViewingDist) - 8usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::numRefDisplaysMinus1"]
        [::core::mem::offset_of!(_HEVC_3D_REFERENCE_DISPLAY_INFO, numRefDisplaysMinus1) - 12usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::leftViewId"]
        [::core::mem::offset_of!(_HEVC_3D_REFERENCE_DISPLAY_INFO, leftViewId) - 16usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::rightViewId"]
        [::core::mem::offset_of!(_HEVC_3D_REFERENCE_DISPLAY_INFO, rightViewId) - 144usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::exponentRefDisplayWidth"][::core::mem::offset_of!(
        _HEVC_3D_REFERENCE_DISPLAY_INFO,
        exponentRefDisplayWidth
    ) - 272usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::mantissaRefDisplayWidth"][::core::mem::offset_of!(
        _HEVC_3D_REFERENCE_DISPLAY_INFO,
        mantissaRefDisplayWidth
    ) - 400usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::exponentRefViewingDistance"][::core::mem::offset_of!(
        _HEVC_3D_REFERENCE_DISPLAY_INFO,
        exponentRefViewingDistance
    ) - 528usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::mantissaRefViewingDistance"][::core::mem::offset_of!(
        _HEVC_3D_REFERENCE_DISPLAY_INFO,
        mantissaRefViewingDistance
    ) - 656usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::numSampleShiftPlus512"][::core::mem::offset_of!(
        _HEVC_3D_REFERENCE_DISPLAY_INFO,
        numSampleShiftPlus512
    ) - 784usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::additionalShiftPresentFlag"][::core::mem::offset_of!(
        _HEVC_3D_REFERENCE_DISPLAY_INFO,
        additionalShiftPresentFlag
    ) - 912usize];
    ["Offset of field: _HEVC_3D_REFERENCE_DISPLAY_INFO::reserved2"]
        [::core::mem::offset_of!(_HEVC_3D_REFERENCE_DISPLAY_INFO, reserved2) - 944usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CHROMA_POINTS"][::core::mem::size_of::<_CHROMA_POINTS>() - 4usize];
    ["Alignment of _CHROMA_POINTS"][::core::mem::align_of::<_CHROMA_POINTS>() - 2usize];
    ["Offset of field: _CHROMA_POINTS::x"][::core::mem::offset_of!(_CHROMA_POINTS, x) - 0usize];
    ["Offset of field: _CHROMA_POINTS::y"][::core::mem::offset_of!(_CHROMA_POINTS, y) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _MASTERING_DISPLAY_INFO"]
        [::core::mem::size_of::<_MASTERING_DISPLAY_INFO>() - 24usize];
    ["Alignment of _MASTERING_DISPLAY_INFO"]
        [::core::mem::align_of::<_MASTERING_DISPLAY_INFO>() - 4usize];
    ["Offset of field: _MASTERING_DISPLAY_INFO::g"]
        [::core::mem::offset_of!(_MASTERING_DISPLAY_INFO, g) - 0usize];
    ["Offset of field: _MASTERING_DISPLAY_INFO::b"]
        [::core::mem::offset_of!(_MASTERING_DISPLAY_INFO, b) - 4usize];
    ["Offset of field: _MASTERING_DISPLAY_INFO::r"]
        [::core::mem::offset_of!(_MASTERING_DISPLAY_INFO, r) - 8usize];
    ["Offset of field: _MASTERING_DISPLAY_INFO::whitePoint"]
        [::core::mem::offset_of!(_MASTERING_DISPLAY_INFO, whitePoint) - 12usize];
    ["Offset of field: _MASTERING_DISPLAY_INFO::maxLuma"]
        [::core::mem::offset_of!(_MASTERING_DISPLAY_INFO, maxLuma) - 16usize];
    ["Offset of field: _MASTERING_DISPLAY_INFO::minLuma"]
        [::core::mem::offset_of!(_MASTERING_DISPLAY_INFO, minLuma) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CONTENT_LIGHT_LEVEL"][::core::mem::size_of::<_CONTENT_LIGHT_LEVEL>() - 4usize];
    ["Alignment of _CONTENT_LIGHT_LEVEL"][::core::mem::align_of::<_CONTENT_LIGHT_LEVEL>() - 2usize];
    ["Offset of field: _CONTENT_LIGHT_LEVEL::maxContentLightLevel"]
        [::core::mem::offset_of!(_CONTENT_LIGHT_LEVEL, maxContentLightLevel) - 0usize];
    ["Offset of field: _CONTENT_LIGHT_LEVEL::maxPicAverageLightLevel"]
        [::core::mem::offset_of!(_CONTENT_LIGHT_LEVEL, maxPicAverageLightLevel) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CONFIG_H264_VUI_PARAMETERS"]
        [::core::mem::size_of::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>() - 112usize];
    ["Alignment of _NV_ENC_CONFIG_H264_VUI_PARAMETERS"]
        [::core::mem::align_of::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>() - 4usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::overscanInfoPresentFlag"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        overscanInfoPresentFlag
    ) - 0usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::overscanInfo"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS, overscanInfo) - 4usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::videoSignalTypePresentFlag"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        videoSignalTypePresentFlag
    ) - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::videoFormat"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS, videoFormat) - 12usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::videoFullRangeFlag"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS, videoFullRangeFlag) - 16usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::colourDescriptionPresentFlag"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        colourDescriptionPresentFlag
    )
        - 20usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::colourPrimaries"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS, colourPrimaries) - 24usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::transferCharacteristics"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        transferCharacteristics
    ) - 28usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::colourMatrix"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS, colourMatrix) - 32usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::chromaSampleLocationFlag"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        chromaSampleLocationFlag
    ) - 36usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::chromaSampleLocationTop"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        chromaSampleLocationTop
    ) - 40usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::chromaSampleLocationBot"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        chromaSampleLocationBot
    ) - 44usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::bitstreamRestrictionFlag"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        bitstreamRestrictionFlag
    ) - 48usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::timingInfoPresentFlag"][::core::mem::offset_of!(
        _NV_ENC_CONFIG_H264_VUI_PARAMETERS,
        timingInfoPresentFlag
    ) - 52usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::numUnitInTicks"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS, numUnitInTicks) - 56usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::timeScale"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS, timeScale) - 60usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_VUI_PARAMETERS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS, reserved) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE"]
        [::core::mem::size_of::<_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE>() - 16usize];
    ["Alignment of _NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE"]
        [::core::mem::align_of::<_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE>() - 4usize];
    ["Offset of field: _NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE::reserved1"]
        [::core::mem::offset_of!(_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE, reserved1) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NVENC_EXTERNAL_ME_HINT"][::core::mem::size_of::<_NVENC_EXTERNAL_ME_HINT>() - 4usize];
    ["Alignment of _NVENC_EXTERNAL_ME_HINT"]
        [::core::mem::align_of::<_NVENC_EXTERNAL_ME_HINT>() - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NVENC_EXTERNAL_ME_SB_HINT"]
        [::core::mem::size_of::<_NVENC_EXTERNAL_ME_SB_HINT>() - 6usize];
    ["Alignment of _NVENC_EXTERNAL_ME_SB_HINT"]
        [::core::mem::align_of::<_NVENC_EXTERNAL_ME_SB_HINT>() - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CONFIG_H264"][::core::mem::size_of::<_NV_ENC_CONFIG_H264>() - 1792usize];
    ["Alignment of _NV_ENC_CONFIG_H264"][::core::mem::align_of::<_NV_ENC_CONFIG_H264>() - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::level"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, level) - 4usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::idrPeriod"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, idrPeriod) - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::separateColourPlaneFlag"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, separateColourPlaneFlag) - 12usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::disableDeblockingFilterIDC"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, disableDeblockingFilterIDC) - 16usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::numTemporalLayers"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, numTemporalLayers) - 20usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::spsId"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, spsId) - 24usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::ppsId"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, ppsId) - 28usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::adaptiveTransformMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, adaptiveTransformMode) - 32usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::fmoMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, fmoMode) - 36usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::bdirectMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, bdirectMode) - 40usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::entropyCodingMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, entropyCodingMode) - 44usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::stereoMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, stereoMode) - 48usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::intraRefreshPeriod"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, intraRefreshPeriod) - 52usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::intraRefreshCnt"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, intraRefreshCnt) - 56usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::maxNumRefFrames"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, maxNumRefFrames) - 60usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::sliceMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, sliceMode) - 64usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::sliceModeData"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, sliceModeData) - 68usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::h264VUIParameters"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, h264VUIParameters) - 72usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::ltrNumFrames"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, ltrNumFrames) - 184usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::ltrTrustMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, ltrTrustMode) - 188usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::chromaFormatIDC"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, chromaFormatIDC) - 192usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::maxTemporalLayers"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, maxTemporalLayers) - 196usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::useBFramesAsRef"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, useBFramesAsRef) - 200usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::numRefL0"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, numRefL0) - 204usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::numRefL1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, numRefL1) - 208usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::outputBitDepth"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, outputBitDepth) - 212usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::inputBitDepth"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, inputBitDepth) - 216usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::tfLevel"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, tfLevel) - 220usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, reserved1) - 224usize];
    ["Offset of field: _NV_ENC_CONFIG_H264::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264, reserved2) - 1280usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CONFIG_HEVC"][::core::mem::size_of::<_NV_ENC_CONFIG_HEVC>() - 1560usize];
    ["Alignment of _NV_ENC_CONFIG_HEVC"][::core::mem::align_of::<_NV_ENC_CONFIG_HEVC>() - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::level"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, level) - 0usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::tier"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, tier) - 4usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::minCUSize"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, minCUSize) - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::maxCUSize"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, maxCUSize) - 12usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::idrPeriod"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, idrPeriod) - 20usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::intraRefreshPeriod"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, intraRefreshPeriod) - 24usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::intraRefreshCnt"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, intraRefreshCnt) - 28usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::maxNumRefFramesInDPB"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, maxNumRefFramesInDPB) - 32usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::ltrNumFrames"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, ltrNumFrames) - 36usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::vpsId"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, vpsId) - 40usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::spsId"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, spsId) - 44usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::ppsId"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, ppsId) - 48usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::sliceMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, sliceMode) - 52usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::sliceModeData"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, sliceModeData) - 56usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::maxTemporalLayersMinus1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, maxTemporalLayersMinus1) - 60usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::hevcVUIParameters"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, hevcVUIParameters) - 64usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::ltrTrustMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, ltrTrustMode) - 176usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::useBFramesAsRef"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, useBFramesAsRef) - 180usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::numRefL0"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, numRefL0) - 184usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::numRefL1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, numRefL1) - 188usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::tfLevel"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, tfLevel) - 192usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::disableDeblockingFilterIDC"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, disableDeblockingFilterIDC) - 196usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::outputBitDepth"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, outputBitDepth) - 200usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::inputBitDepth"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, inputBitDepth) - 204usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::numTemporalLayers"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, numTemporalLayers) - 208usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::numViews"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, numViews) - 212usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, reserved1) - 216usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC, reserved2) - 1048usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_FILM_GRAIN_PARAMS_AV1"]
        [::core::mem::size_of::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>() - 156usize];
    ["Alignment of _NV_ENC_FILM_GRAIN_PARAMS_AV1"]
        [::core::mem::align_of::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>() - 4usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::pointYValue"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, pointYValue) - 4usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::pointYScaling"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, pointYScaling) - 18usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::pointCbValue"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, pointCbValue) - 32usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::pointCbScaling"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, pointCbScaling) - 42usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::pointCrValue"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, pointCrValue) - 52usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::pointCrScaling"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, pointCrScaling) - 62usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::arCoeffsYPlus128"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, arCoeffsYPlus128) - 72usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::arCoeffsCbPlus128"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, arCoeffsCbPlus128) - 96usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::arCoeffsCrPlus128"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, arCoeffsCrPlus128) - 121usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, reserved2) - 146usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::cbMult"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, cbMult) - 148usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::cbLumaMult"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, cbLumaMult) - 149usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::cbOffset"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, cbOffset) - 150usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::crMult"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, crMult) - 152usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::crLumaMult"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, crLumaMult) - 153usize];
    ["Offset of field: _NV_ENC_FILM_GRAIN_PARAMS_AV1::crOffset"]
        [::core::mem::offset_of!(_NV_ENC_FILM_GRAIN_PARAMS_AV1, crOffset) - 154usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CONFIG_AV1"][::core::mem::size_of::<_NV_ENC_CONFIG_AV1>() - 1552usize];
    ["Alignment of _NV_ENC_CONFIG_AV1"][::core::mem::align_of::<_NV_ENC_CONFIG_AV1>() - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::level"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, level) - 0usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::tier"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, tier) - 4usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::minPartSize"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, minPartSize) - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::maxPartSize"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, maxPartSize) - 12usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::idrPeriod"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, idrPeriod) - 20usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::intraRefreshPeriod"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, intraRefreshPeriod) - 24usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::intraRefreshCnt"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, intraRefreshCnt) - 28usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::maxNumRefFramesInDPB"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, maxNumRefFramesInDPB) - 32usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::numTileColumns"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, numTileColumns) - 36usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::numTileRows"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, numTileRows) - 40usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, reserved2) - 44usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::tileWidths"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, tileWidths) - 48usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::tileHeights"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, tileHeights) - 56usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::maxTemporalLayersMinus1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, maxTemporalLayersMinus1) - 64usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::colorPrimaries"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, colorPrimaries) - 68usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::transferCharacteristics"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, transferCharacteristics) - 72usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::matrixCoefficients"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, matrixCoefficients) - 76usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::colorRange"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, colorRange) - 80usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::chromaSamplePosition"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, chromaSamplePosition) - 84usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::useBFramesAsRef"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, useBFramesAsRef) - 88usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::filmGrainParams"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, filmGrainParams) - 96usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::numFwdRefs"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, numFwdRefs) - 104usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::numBwdRefs"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, numBwdRefs) - 108usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::outputBitDepth"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, outputBitDepth) - 112usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::inputBitDepth"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, inputBitDepth) - 116usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::ltrNumFrames"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, ltrNumFrames) - 120usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::numTemporalLayers"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, numTemporalLayers) - 124usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::tfLevel"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, tfLevel) - 128usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, reserved1) - 132usize];
    ["Offset of field: _NV_ENC_CONFIG_AV1::reserved3"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_AV1, reserved3) - 1056usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CONFIG_H264_MEONLY"]
        [::core::mem::size_of::<_NV_ENC_CONFIG_H264_MEONLY>() - 1536usize];
    ["Alignment of _NV_ENC_CONFIG_H264_MEONLY"]
        [::core::mem::align_of::<_NV_ENC_CONFIG_H264_MEONLY>() - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_MEONLY::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_MEONLY, reserved1) - 4usize];
    ["Offset of field: _NV_ENC_CONFIG_H264_MEONLY::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_H264_MEONLY, reserved2) - 1024usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CONFIG_HEVC_MEONLY"]
        [::core::mem::size_of::<_NV_ENC_CONFIG_HEVC_MEONLY>() - 1536usize];
    ["Alignment of _NV_ENC_CONFIG_HEVC_MEONLY"]
        [::core::mem::align_of::<_NV_ENC_CONFIG_HEVC_MEONLY>() - 8usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC_MEONLY::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC_MEONLY, reserved) - 0usize];
    ["Offset of field: _NV_ENC_CONFIG_HEVC_MEONLY::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG_HEVC_MEONLY, reserved1) - 1024usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CODEC_CONFIG"][::core::mem::size_of::<_NV_ENC_CODEC_CONFIG>() - 1792usize];
    ["Alignment of _NV_ENC_CODEC_CONFIG"][::core::mem::align_of::<_NV_ENC_CODEC_CONFIG>() - 8usize];
    ["Offset of field: _NV_ENC_CODEC_CONFIG::h264Config"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_CONFIG, h264Config) - 0usize];
    ["Offset of field: _NV_ENC_CODEC_CONFIG::hevcConfig"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_CONFIG, hevcConfig) - 0usize];
    ["Offset of field: _NV_ENC_CODEC_CONFIG::av1Config"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_CONFIG, av1Config) - 0usize];
    ["Offset of field: _NV_ENC_CODEC_CONFIG::h264MeOnlyConfig"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_CONFIG, h264MeOnlyConfig) - 0usize];
    ["Offset of field: _NV_ENC_CODEC_CONFIG::hevcMeOnlyConfig"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_CONFIG, hevcMeOnlyConfig) - 0usize];
    ["Offset of field: _NV_ENC_CODEC_CONFIG::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_CONFIG, reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CONFIG"][::core::mem::size_of::<_NV_ENC_CONFIG>() - 3584usize];
    ["Alignment of _NV_ENC_CONFIG"][::core::mem::align_of::<_NV_ENC_CONFIG>() - 8usize];
    ["Offset of field: _NV_ENC_CONFIG::version"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, version) - 0usize];
    ["Offset of field: _NV_ENC_CONFIG::profileGUID"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, profileGUID) - 4usize];
    ["Offset of field: _NV_ENC_CONFIG::gopLength"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, gopLength) - 20usize];
    ["Offset of field: _NV_ENC_CONFIG::frameIntervalP"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, frameIntervalP) - 24usize];
    ["Offset of field: _NV_ENC_CONFIG::monoChromeEncoding"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, monoChromeEncoding) - 28usize];
    ["Offset of field: _NV_ENC_CONFIG::frameFieldMode"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, frameFieldMode) - 32usize];
    ["Offset of field: _NV_ENC_CONFIG::mvPrecision"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, mvPrecision) - 36usize];
    ["Offset of field: _NV_ENC_CONFIG::rcParams"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, rcParams) - 40usize];
    ["Offset of field: _NV_ENC_CONFIG::encodeCodecConfig"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, encodeCodecConfig) - 168usize];
    ["Offset of field: _NV_ENC_CONFIG::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, reserved) - 1960usize];
    ["Offset of field: _NV_ENC_CONFIG::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_CONFIG, reserved2) - 3072usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_INITIALIZE_PARAMS"]
        [::core::mem::size_of::<_NV_ENC_INITIALIZE_PARAMS>() - 1800usize];
    ["Alignment of _NV_ENC_INITIALIZE_PARAMS"]
        [::core::mem::align_of::<_NV_ENC_INITIALIZE_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::encodeGUID"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, encodeGUID) - 4usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::presetGUID"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, presetGUID) - 20usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::encodeWidth"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, encodeWidth) - 36usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::encodeHeight"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, encodeHeight) - 40usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::darWidth"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, darWidth) - 44usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::darHeight"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, darHeight) - 48usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::frameRateNum"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, frameRateNum) - 52usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::frameRateDen"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, frameRateDen) - 56usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::enableEncodeAsync"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, enableEncodeAsync) - 60usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::enablePTD"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, enablePTD) - 64usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::privDataSize"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, privDataSize) - 72usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, reserved) - 76usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::privData"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, privData) - 80usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::encodeConfig"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, encodeConfig) - 88usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::maxEncodeWidth"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, maxEncodeWidth) - 96usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::maxEncodeHeight"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, maxEncodeHeight) - 100usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::maxMEHintCountsPerBlock"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, maxMEHintCountsPerBlock) - 104usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::tuningInfo"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, tuningInfo) - 136usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::bufferFormat"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, bufferFormat) - 140usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::numStateBuffers"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, numStateBuffers) - 144usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::outputStatsLevel"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, outputStatsLevel) - 148usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, reserved1) - 152usize];
    ["Offset of field: _NV_ENC_INITIALIZE_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_INITIALIZE_PARAMS, reserved2) - 1288usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_RECONFIGURE_PARAMS"]
        [::core::mem::size_of::<_NV_ENC_RECONFIGURE_PARAMS>() - 1816usize];
    ["Alignment of _NV_ENC_RECONFIGURE_PARAMS"]
        [::core::mem::align_of::<_NV_ENC_RECONFIGURE_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_RECONFIGURE_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_RECONFIGURE_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_RECONFIGURE_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_RECONFIGURE_PARAMS, reserved) - 4usize];
    ["Offset of field: _NV_ENC_RECONFIGURE_PARAMS::reInitEncodeParams"]
        [::core::mem::offset_of!(_NV_ENC_RECONFIGURE_PARAMS, reInitEncodeParams) - 8usize];
    ["Offset of field: _NV_ENC_RECONFIGURE_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_RECONFIGURE_PARAMS, reserved2) - 1812usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_PRESET_CONFIG"][::core::mem::size_of::<_NV_ENC_PRESET_CONFIG>() - 5128usize];
    ["Alignment of _NV_ENC_PRESET_CONFIG"]
        [::core::mem::align_of::<_NV_ENC_PRESET_CONFIG>() - 8usize];
    ["Offset of field: _NV_ENC_PRESET_CONFIG::version"]
        [::core::mem::offset_of!(_NV_ENC_PRESET_CONFIG, version) - 0usize];
    ["Offset of field: _NV_ENC_PRESET_CONFIG::reserved"]
        [::core::mem::offset_of!(_NV_ENC_PRESET_CONFIG, reserved) - 4usize];
    ["Offset of field: _NV_ENC_PRESET_CONFIG::presetCfg"]
        [::core::mem::offset_of!(_NV_ENC_PRESET_CONFIG, presetCfg) - 8usize];
    ["Offset of field: _NV_ENC_PRESET_CONFIG::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_PRESET_CONFIG, reserved1) - 3592usize];
    ["Offset of field: _NV_ENC_PRESET_CONFIG::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_PRESET_CONFIG, reserved2) - 4616usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_PIC_PARAMS_MVC"][::core::mem::size_of::<_NV_ENC_PIC_PARAMS_MVC>() - 128usize];
    ["Alignment of _NV_ENC_PIC_PARAMS_MVC"]
        [::core::mem::align_of::<_NV_ENC_PIC_PARAMS_MVC>() - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_MVC::version"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_MVC, version) - 0usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_MVC::viewID"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_MVC, viewID) - 4usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_MVC::temporalID"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_MVC, temporalID) - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_MVC::priorityID"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_MVC, priorityID) - 12usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_MVC::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_MVC, reserved1) - 16usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_MVC::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_MVC, reserved2) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_PIC_PARAMS_H264_EXT"]
        [::core::mem::size_of::<_NV_ENC_PIC_PARAMS_H264_EXT>() - 128usize];
    ["Alignment of _NV_ENC_PIC_PARAMS_H264_EXT"]
        [::core::mem::align_of::<_NV_ENC_PIC_PARAMS_H264_EXT>() - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264_EXT::mvcPicParams"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264_EXT, mvcPicParams) - 0usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264_EXT::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264_EXT, reserved1) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_SEI_PAYLOAD"][::core::mem::size_of::<_NV_ENC_SEI_PAYLOAD>() - 16usize];
    ["Alignment of _NV_ENC_SEI_PAYLOAD"][::core::mem::align_of::<_NV_ENC_SEI_PAYLOAD>() - 8usize];
    ["Offset of field: _NV_ENC_SEI_PAYLOAD::payloadSize"]
        [::core::mem::offset_of!(_NV_ENC_SEI_PAYLOAD, payloadSize) - 0usize];
    ["Offset of field: _NV_ENC_SEI_PAYLOAD::payloadType"]
        [::core::mem::offset_of!(_NV_ENC_SEI_PAYLOAD, payloadType) - 4usize];
    ["Offset of field: _NV_ENC_SEI_PAYLOAD::payload"]
        [::core::mem::offset_of!(_NV_ENC_SEI_PAYLOAD, payload) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_PIC_PARAMS_H264"]
        [::core::mem::size_of::<_NV_ENC_PIC_PARAMS_H264>() - 1536usize];
    ["Alignment of _NV_ENC_PIC_PARAMS_H264"]
        [::core::mem::align_of::<_NV_ENC_PIC_PARAMS_H264>() - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::displayPOCSyntax"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, displayPOCSyntax) - 0usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::reserved3"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, reserved3) - 4usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::refPicFlag"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, refPicFlag) - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::colourPlaneId"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, colourPlaneId) - 12usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::forceIntraRefreshWithFrameCnt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, forceIntraRefreshWithFrameCnt) - 16usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::sliceTypeData"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, sliceTypeData) - 24usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::sliceTypeArrayCnt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, sliceTypeArrayCnt) - 32usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::seiPayloadArrayCnt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, seiPayloadArrayCnt) - 36usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::seiPayloadArray"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, seiPayloadArray) - 40usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::sliceMode"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, sliceMode) - 48usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::sliceModeData"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, sliceModeData) - 52usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::ltrMarkFrameIdx"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, ltrMarkFrameIdx) - 56usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::ltrUseFrameBitmap"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, ltrUseFrameBitmap) - 60usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::ltrUsageMode"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, ltrUsageMode) - 64usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::forceIntraSliceCount"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, forceIntraSliceCount) - 68usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::forceIntraSliceIdx"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, forceIntraSliceIdx) - 72usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::h264ExtPicParams"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, h264ExtPicParams) - 80usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::timeCode"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, timeCode) - 208usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::reserved"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, reserved) - 240usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_H264::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_H264, reserved2) - 1048usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_PIC_PARAMS_HEVC"]
        [::core::mem::size_of::<_NV_ENC_PIC_PARAMS_HEVC>() - 1536usize];
    ["Alignment of _NV_ENC_PIC_PARAMS_HEVC"]
        [::core::mem::align_of::<_NV_ENC_PIC_PARAMS_HEVC>() - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::displayPOCSyntax"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, displayPOCSyntax) - 0usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::refPicFlag"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, refPicFlag) - 4usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::temporalId"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, temporalId) - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::forceIntraRefreshWithFrameCnt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, forceIntraRefreshWithFrameCnt) - 12usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, reserved1) - 20usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::sliceTypeData"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, sliceTypeData) - 24usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::sliceTypeArrayCnt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, sliceTypeArrayCnt) - 32usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::sliceMode"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, sliceMode) - 36usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::sliceModeData"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, sliceModeData) - 40usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::ltrMarkFrameIdx"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, ltrMarkFrameIdx) - 44usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::ltrUseFrameBitmap"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, ltrUseFrameBitmap) - 48usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::ltrUsageMode"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, ltrUsageMode) - 52usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::seiPayloadArrayCnt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, seiPayloadArrayCnt) - 56usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::reserved"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, reserved) - 60usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::seiPayloadArray"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, seiPayloadArray) - 64usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::timeCode"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, timeCode) - 72usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::numTemporalLayers"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, numTemporalLayers) - 104usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::viewId"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, viewId) - 108usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::p3DReferenceDisplayInfo"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, p3DReferenceDisplayInfo) - 112usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::pMaxCll"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, pMaxCll) - 120usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::pMasteringDisplay"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, pMasteringDisplay) - 128usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, reserved2) - 136usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_HEVC::reserved3"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_HEVC, reserved3) - 1072usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_PIC_PARAMS_AV1"]
        [::core::mem::size_of::<_NV_ENC_PIC_PARAMS_AV1>() - 1544usize];
    ["Alignment of _NV_ENC_PIC_PARAMS_AV1"]
        [::core::mem::align_of::<_NV_ENC_PIC_PARAMS_AV1>() - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::displayPOCSyntax"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, displayPOCSyntax) - 0usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::refPicFlag"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, refPicFlag) - 4usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::temporalId"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, temporalId) - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::forceIntraRefreshWithFrameCnt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, forceIntraRefreshWithFrameCnt) - 12usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::numTileColumns"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, numTileColumns) - 20usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::numTileRows"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, numTileRows) - 24usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::reserved"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, reserved) - 28usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::tileWidths"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, tileWidths) - 32usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::tileHeights"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, tileHeights) - 40usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::obuPayloadArrayCnt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, obuPayloadArrayCnt) - 48usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, reserved1) - 52usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::obuPayloadArray"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, obuPayloadArray) - 56usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::filmGrainParams"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, filmGrainParams) - 64usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::ltrMarkFrameIdx"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, ltrMarkFrameIdx) - 72usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::ltrUseFrameBitmap"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, ltrUseFrameBitmap) - 76usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::numTemporalLayers"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, numTemporalLayers) - 80usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::reserved4"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, reserved4) - 84usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::pMaxCll"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, pMaxCll) - 88usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::pMasteringDisplay"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, pMasteringDisplay) - 96usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, reserved2) - 104usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS_AV1::reserved3"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS_AV1, reserved3) - 1072usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_CODEC_PIC_PARAMS"]
        [::core::mem::size_of::<_NV_ENC_CODEC_PIC_PARAMS>() - 1544usize];
    ["Alignment of _NV_ENC_CODEC_PIC_PARAMS"]
        [::core::mem::align_of::<_NV_ENC_CODEC_PIC_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_CODEC_PIC_PARAMS::h264PicParams"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_PIC_PARAMS, h264PicParams) - 0usize];
    ["Offset of field: _NV_ENC_CODEC_PIC_PARAMS::hevcPicParams"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_PIC_PARAMS, hevcPicParams) - 0usize];
    ["Offset of field: _NV_ENC_CODEC_PIC_PARAMS::av1PicParams"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_PIC_PARAMS, av1PicParams) - 0usize];
    ["Offset of field: _NV_ENC_CODEC_PIC_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_CODEC_PIC_PARAMS, reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_PIC_PARAMS"][::core::mem::size_of::<_NV_ENC_PIC_PARAMS>() - 3360usize];
    ["Alignment of _NV_ENC_PIC_PARAMS"][::core::mem::align_of::<_NV_ENC_PIC_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::inputWidth"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, inputWidth) - 4usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::inputHeight"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, inputHeight) - 8usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::inputPitch"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, inputPitch) - 12usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::encodePicFlags"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, encodePicFlags) - 16usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::frameIdx"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, frameIdx) - 20usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::inputTimeStamp"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, inputTimeStamp) - 24usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::inputDuration"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, inputDuration) - 32usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::inputBuffer"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, inputBuffer) - 40usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::outputBitstream"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, outputBitstream) - 48usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::completionEvent"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, completionEvent) - 56usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::bufferFmt"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, bufferFmt) - 64usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::pictureStruct"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, pictureStruct) - 68usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::pictureType"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, pictureType) - 72usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::codecPicParams"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, codecPicParams) - 80usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::meHintCountsPerBlock"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, meHintCountsPerBlock) - 1624usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::meExternalHints"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, meExternalHints) - 1656usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, reserved2) - 1664usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::reserved5"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, reserved5) - 1696usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::qpDeltaMap"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, qpDeltaMap) - 1712usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::qpDeltaMapSize"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, qpDeltaMapSize) - 1720usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::reservedBitFields"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, reservedBitFields) - 1724usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::meHintRefPicDist"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, meHintRefPicDist) - 1728usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::reserved4"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, reserved4) - 1732usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::alphaBuffer"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, alphaBuffer) - 1736usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::meExternalSbHints"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, meExternalSbHints) - 1744usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::meSbHintsCount"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, meSbHintsCount) - 1752usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::stateBufferIdx"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, stateBufferIdx) - 1756usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::outputReconBuffer"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, outputReconBuffer) - 1760usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::reserved3"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, reserved3) - 1768usize];
    ["Offset of field: _NV_ENC_PIC_PARAMS::reserved6"]
        [::core::mem::offset_of!(_NV_ENC_PIC_PARAMS, reserved6) - 2904usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_MEONLY_PARAMS"][::core::mem::size_of::<_NV_ENC_MEONLY_PARAMS>() - 1544usize];
    ["Alignment of _NV_ENC_MEONLY_PARAMS"]
        [::core::mem::align_of::<_NV_ENC_MEONLY_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::inputWidth"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, inputWidth) - 4usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::inputHeight"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, inputHeight) - 8usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, reserved) - 12usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::inputBuffer"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, inputBuffer) - 16usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::referenceFrame"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, referenceFrame) - 24usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::mvBuffer"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, mvBuffer) - 32usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, reserved2) - 40usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::bufferFmt"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, bufferFmt) - 44usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::completionEvent"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, completionEvent) - 48usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::viewID"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, viewID) - 56usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::meHintCountsPerBlock"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, meHintCountsPerBlock) - 60usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::meExternalHints"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, meExternalHints) - 96usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, reserved1) - 104usize];
    ["Offset of field: _NV_ENC_MEONLY_PARAMS::reserved3"]
        [::core::mem::offset_of!(_NV_ENC_MEONLY_PARAMS, reserved3) - 1072usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_LOCK_BITSTREAM"]
        [::core::mem::size_of::<_NV_ENC_LOCK_BITSTREAM>() - 1544usize];
    ["Alignment of _NV_ENC_LOCK_BITSTREAM"]
        [::core::mem::align_of::<_NV_ENC_LOCK_BITSTREAM>() - 8usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::version"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, version) - 0usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::outputBitstream"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, outputBitstream) - 8usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::sliceOffsets"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, sliceOffsets) - 16usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::frameIdx"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, frameIdx) - 24usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::hwEncodeStatus"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, hwEncodeStatus) - 28usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::numSlices"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, numSlices) - 32usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::bitstreamSizeInBytes"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, bitstreamSizeInBytes) - 36usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::outputTimeStamp"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, outputTimeStamp) - 40usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::outputDuration"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, outputDuration) - 48usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::bitstreamBufferPtr"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, bitstreamBufferPtr) - 56usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::pictureType"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, pictureType) - 64usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::pictureStruct"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, pictureStruct) - 68usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::frameAvgQP"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, frameAvgQP) - 72usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::frameSatd"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, frameSatd) - 76usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::ltrFrameIdx"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, ltrFrameIdx) - 80usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::ltrFrameBitmap"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, ltrFrameBitmap) - 84usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::temporalId"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, temporalId) - 88usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::intraMBCount"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, intraMBCount) - 92usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::interMBCount"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, interMBCount) - 96usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::averageMVX"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, averageMVX) - 100usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::averageMVY"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, averageMVY) - 104usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::alphaLayerSizeInBytes"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, alphaLayerSizeInBytes) - 108usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::outputStatsPtrSize"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, outputStatsPtrSize) - 112usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::reserved"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, reserved) - 116usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::outputStatsPtr"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, outputStatsPtr) - 120usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::frameIdxDisplay"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, frameIdxDisplay) - 128usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, reserved1) - 132usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, reserved2) - 1008usize];
    ["Offset of field: _NV_ENC_LOCK_BITSTREAM::reservedInternal"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_BITSTREAM, reservedInternal) - 1512usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_LOCK_INPUT_BUFFER"]
        [::core::mem::size_of::<_NV_ENC_LOCK_INPUT_BUFFER>() - 1544usize];
    ["Alignment of _NV_ENC_LOCK_INPUT_BUFFER"]
        [::core::mem::align_of::<_NV_ENC_LOCK_INPUT_BUFFER>() - 8usize];
    ["Offset of field: _NV_ENC_LOCK_INPUT_BUFFER::version"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_INPUT_BUFFER, version) - 0usize];
    ["Offset of field: _NV_ENC_LOCK_INPUT_BUFFER::inputBuffer"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_INPUT_BUFFER, inputBuffer) - 8usize];
    ["Offset of field: _NV_ENC_LOCK_INPUT_BUFFER::bufferDataPtr"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_INPUT_BUFFER, bufferDataPtr) - 16usize];
    ["Offset of field: _NV_ENC_LOCK_INPUT_BUFFER::pitch"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_INPUT_BUFFER, pitch) - 24usize];
    ["Offset of field: _NV_ENC_LOCK_INPUT_BUFFER::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_INPUT_BUFFER, reserved1) - 28usize];
    ["Offset of field: _NV_ENC_LOCK_INPUT_BUFFER::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_LOCK_INPUT_BUFFER, reserved2) - 1032usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_MAP_INPUT_RESOURCE"]
        [::core::mem::size_of::<_NV_ENC_MAP_INPUT_RESOURCE>() - 1544usize];
    ["Alignment of _NV_ENC_MAP_INPUT_RESOURCE"]
        [::core::mem::align_of::<_NV_ENC_MAP_INPUT_RESOURCE>() - 8usize];
    ["Offset of field: _NV_ENC_MAP_INPUT_RESOURCE::version"]
        [::core::mem::offset_of!(_NV_ENC_MAP_INPUT_RESOURCE, version) - 0usize];
    ["Offset of field: _NV_ENC_MAP_INPUT_RESOURCE::subResourceIndex"]
        [::core::mem::offset_of!(_NV_ENC_MAP_INPUT_RESOURCE, subResourceIndex) - 4usize];
    ["Offset of field: _NV_ENC_MAP_INPUT_RESOURCE::inputResource"]
        [::core::mem::offset_of!(_NV_ENC_MAP_INPUT_RESOURCE, inputResource) - 8usize];
    ["Offset of field: _NV_ENC_MAP_INPUT_RESOURCE::registeredResource"]
        [::core::mem::offset_of!(_NV_ENC_MAP_INPUT_RESOURCE, registeredResource) - 16usize];
    ["Offset of field: _NV_ENC_MAP_INPUT_RESOURCE::mappedResource"]
        [::core::mem::offset_of!(_NV_ENC_MAP_INPUT_RESOURCE, mappedResource) - 24usize];
    ["Offset of field: _NV_ENC_MAP_INPUT_RESOURCE::mappedBufferFmt"]
        [::core::mem::offset_of!(_NV_ENC_MAP_INPUT_RESOURCE, mappedBufferFmt) - 32usize];
    ["Offset of field: _NV_ENC_MAP_INPUT_RESOURCE::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_MAP_INPUT_RESOURCE, reserved1) - 36usize];
    ["Offset of field: _NV_ENC_MAP_INPUT_RESOURCE::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_MAP_INPUT_RESOURCE, reserved2) - 1040usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_INPUT_RESOURCE_OPENGL_TEX"]
        [::core::mem::size_of::<_NV_ENC_INPUT_RESOURCE_OPENGL_TEX>() - 8usize];
    ["Alignment of _NV_ENC_INPUT_RESOURCE_OPENGL_TEX"]
        [::core::mem::align_of::<_NV_ENC_INPUT_RESOURCE_OPENGL_TEX>() - 4usize];
    ["Offset of field: _NV_ENC_INPUT_RESOURCE_OPENGL_TEX::texture"]
        [::core::mem::offset_of!(_NV_ENC_INPUT_RESOURCE_OPENGL_TEX, texture) - 0usize];
    ["Offset of field: _NV_ENC_INPUT_RESOURCE_OPENGL_TEX::target"]
        [::core::mem::offset_of!(_NV_ENC_INPUT_RESOURCE_OPENGL_TEX, target) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_FENCE_POINT_D3D12"]
        [::core::mem::size_of::<_NV_ENC_FENCE_POINT_D3D12>() - 64usize];
    ["Alignment of _NV_ENC_FENCE_POINT_D3D12"]
        [::core::mem::align_of::<_NV_ENC_FENCE_POINT_D3D12>() - 8usize];
    ["Offset of field: _NV_ENC_FENCE_POINT_D3D12::version"]
        [::core::mem::offset_of!(_NV_ENC_FENCE_POINT_D3D12, version) - 0usize];
    ["Offset of field: _NV_ENC_FENCE_POINT_D3D12::reserved"]
        [::core::mem::offset_of!(_NV_ENC_FENCE_POINT_D3D12, reserved) - 4usize];
    ["Offset of field: _NV_ENC_FENCE_POINT_D3D12::pFence"]
        [::core::mem::offset_of!(_NV_ENC_FENCE_POINT_D3D12, pFence) - 8usize];
    ["Offset of field: _NV_ENC_FENCE_POINT_D3D12::waitValue"]
        [::core::mem::offset_of!(_NV_ENC_FENCE_POINT_D3D12, waitValue) - 16usize];
    ["Offset of field: _NV_ENC_FENCE_POINT_D3D12::signalValue"]
        [::core::mem::offset_of!(_NV_ENC_FENCE_POINT_D3D12, signalValue) - 24usize];
    ["Offset of field: _NV_ENC_FENCE_POINT_D3D12::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_FENCE_POINT_D3D12, reserved1) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_INPUT_RESOURCE_D3D12"]
        [::core::mem::size_of::<_NV_ENC_INPUT_RESOURCE_D3D12>() - 272usize];
    ["Alignment of _NV_ENC_INPUT_RESOURCE_D3D12"]
        [::core::mem::align_of::<_NV_ENC_INPUT_RESOURCE_D3D12>() - 8usize];
    ["Offset of field: _NV_ENC_INPUT_RESOURCE_D3D12::version"]
        [::core::mem::offset_of!(_NV_ENC_INPUT_RESOURCE_D3D12, version) - 0usize];
    ["Offset of field: _NV_ENC_INPUT_RESOURCE_D3D12::reserved"]
        [::core::mem::offset_of!(_NV_ENC_INPUT_RESOURCE_D3D12, reserved) - 4usize];
    ["Offset of field: _NV_ENC_INPUT_RESOURCE_D3D12::pInputBuffer"]
        [::core::mem::offset_of!(_NV_ENC_INPUT_RESOURCE_D3D12, pInputBuffer) - 8usize];
    ["Offset of field: _NV_ENC_INPUT_RESOURCE_D3D12::inputFencePoint"]
        [::core::mem::offset_of!(_NV_ENC_INPUT_RESOURCE_D3D12, inputFencePoint) - 16usize];
    ["Offset of field: _NV_ENC_INPUT_RESOURCE_D3D12::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_INPUT_RESOURCE_D3D12, reserved1) - 80usize];
    ["Offset of field: _NV_ENC_INPUT_RESOURCE_D3D12::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_INPUT_RESOURCE_D3D12, reserved2) - 144usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_OUTPUT_RESOURCE_D3D12"]
        [::core::mem::size_of::<_NV_ENC_OUTPUT_RESOURCE_D3D12>() - 272usize];
    ["Alignment of _NV_ENC_OUTPUT_RESOURCE_D3D12"]
        [::core::mem::align_of::<_NV_ENC_OUTPUT_RESOURCE_D3D12>() - 8usize];
    ["Offset of field: _NV_ENC_OUTPUT_RESOURCE_D3D12::version"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_RESOURCE_D3D12, version) - 0usize];
    ["Offset of field: _NV_ENC_OUTPUT_RESOURCE_D3D12::reserved"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_RESOURCE_D3D12, reserved) - 4usize];
    ["Offset of field: _NV_ENC_OUTPUT_RESOURCE_D3D12::pOutputBuffer"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_RESOURCE_D3D12, pOutputBuffer) - 8usize];
    ["Offset of field: _NV_ENC_OUTPUT_RESOURCE_D3D12::outputFencePoint"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_RESOURCE_D3D12, outputFencePoint) - 16usize];
    ["Offset of field: _NV_ENC_OUTPUT_RESOURCE_D3D12::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_RESOURCE_D3D12, reserved1) - 80usize];
    ["Offset of field: _NV_ENC_OUTPUT_RESOURCE_D3D12::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_OUTPUT_RESOURCE_D3D12, reserved2) - 144usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_REGISTER_RESOURCE"]
        [::core::mem::size_of::<_NV_ENC_REGISTER_RESOURCE>() - 1536usize];
    ["Alignment of _NV_ENC_REGISTER_RESOURCE"]
        [::core::mem::align_of::<_NV_ENC_REGISTER_RESOURCE>() - 8usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::version"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, version) - 0usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::resourceType"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, resourceType) - 4usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::width"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, width) - 8usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::height"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, height) - 12usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::pitch"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, pitch) - 16usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::subResourceIndex"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, subResourceIndex) - 20usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::resourceToRegister"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, resourceToRegister) - 24usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::registeredResource"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, registeredResource) - 32usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::bufferFormat"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, bufferFormat) - 40usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::bufferUsage"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, bufferUsage) - 44usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::pInputFencePoint"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, pInputFencePoint) - 48usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::chromaOffset"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, chromaOffset) - 56usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::chromaOffsetIn"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, chromaOffsetIn) - 64usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, reserved1) - 72usize];
    ["Offset of field: _NV_ENC_REGISTER_RESOURCE::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_REGISTER_RESOURCE, reserved2) - 1048usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_STAT"][::core::mem::size_of::<_NV_ENC_STAT>() - 1544usize];
    ["Alignment of _NV_ENC_STAT"][::core::mem::align_of::<_NV_ENC_STAT>() - 8usize];
    ["Offset of field: _NV_ENC_STAT::version"]
        [::core::mem::offset_of!(_NV_ENC_STAT, version) - 0usize];
    ["Offset of field: _NV_ENC_STAT::reserved"]
        [::core::mem::offset_of!(_NV_ENC_STAT, reserved) - 4usize];
    ["Offset of field: _NV_ENC_STAT::outputBitStream"]
        [::core::mem::offset_of!(_NV_ENC_STAT, outputBitStream) - 8usize];
    ["Offset of field: _NV_ENC_STAT::bitStreamSize"]
        [::core::mem::offset_of!(_NV_ENC_STAT, bitStreamSize) - 16usize];
    ["Offset of field: _NV_ENC_STAT::picType"]
        [::core::mem::offset_of!(_NV_ENC_STAT, picType) - 20usize];
    ["Offset of field: _NV_ENC_STAT::lastValidByteOffset"]
        [::core::mem::offset_of!(_NV_ENC_STAT, lastValidByteOffset) - 24usize];
    ["Offset of field: _NV_ENC_STAT::sliceOffsets"]
        [::core::mem::offset_of!(_NV_ENC_STAT, sliceOffsets) - 28usize];
    ["Offset of field: _NV_ENC_STAT::picIdx"]
        [::core::mem::offset_of!(_NV_ENC_STAT, picIdx) - 92usize];
    ["Offset of field: _NV_ENC_STAT::frameAvgQP"]
        [::core::mem::offset_of!(_NV_ENC_STAT, frameAvgQP) - 96usize];
    ["Offset of field: _NV_ENC_STAT::ltrFrameIdx"]
        [::core::mem::offset_of!(_NV_ENC_STAT, ltrFrameIdx) - 104usize];
    ["Offset of field: _NV_ENC_STAT::intraMBCount"]
        [::core::mem::offset_of!(_NV_ENC_STAT, intraMBCount) - 108usize];
    ["Offset of field: _NV_ENC_STAT::interMBCount"]
        [::core::mem::offset_of!(_NV_ENC_STAT, interMBCount) - 112usize];
    ["Offset of field: _NV_ENC_STAT::averageMVX"]
        [::core::mem::offset_of!(_NV_ENC_STAT, averageMVX) - 116usize];
    ["Offset of field: _NV_ENC_STAT::averageMVY"]
        [::core::mem::offset_of!(_NV_ENC_STAT, averageMVY) - 120usize];
    ["Offset of field: _NV_ENC_STAT::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_STAT, reserved1) - 124usize];
    ["Offset of field: _NV_ENC_STAT::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_STAT, reserved2) - 1032usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_SEQUENCE_PARAM_PAYLOAD"]
        [::core::mem::size_of::<_NV_ENC_SEQUENCE_PARAM_PAYLOAD>() - 1544usize];
    ["Alignment of _NV_ENC_SEQUENCE_PARAM_PAYLOAD"]
        [::core::mem::align_of::<_NV_ENC_SEQUENCE_PARAM_PAYLOAD>() - 8usize];
    ["Offset of field: _NV_ENC_SEQUENCE_PARAM_PAYLOAD::version"]
        [::core::mem::offset_of!(_NV_ENC_SEQUENCE_PARAM_PAYLOAD, version) - 0usize];
    ["Offset of field: _NV_ENC_SEQUENCE_PARAM_PAYLOAD::inBufferSize"]
        [::core::mem::offset_of!(_NV_ENC_SEQUENCE_PARAM_PAYLOAD, inBufferSize) - 4usize];
    ["Offset of field: _NV_ENC_SEQUENCE_PARAM_PAYLOAD::spsId"]
        [::core::mem::offset_of!(_NV_ENC_SEQUENCE_PARAM_PAYLOAD, spsId) - 8usize];
    ["Offset of field: _NV_ENC_SEQUENCE_PARAM_PAYLOAD::ppsId"]
        [::core::mem::offset_of!(_NV_ENC_SEQUENCE_PARAM_PAYLOAD, ppsId) - 12usize];
    ["Offset of field: _NV_ENC_SEQUENCE_PARAM_PAYLOAD::spsppsBuffer"]
        [::core::mem::offset_of!(_NV_ENC_SEQUENCE_PARAM_PAYLOAD, spsppsBuffer) - 16usize];
    ["Offset of field: _NV_ENC_SEQUENCE_PARAM_PAYLOAD::outSPSPPSPayloadSize"]
        [::core::mem::offset_of!(_NV_ENC_SEQUENCE_PARAM_PAYLOAD, outSPSPPSPayloadSize) - 24usize];
    ["Offset of field: _NV_ENC_SEQUENCE_PARAM_PAYLOAD::reserved"]
        [::core::mem::offset_of!(_NV_ENC_SEQUENCE_PARAM_PAYLOAD, reserved) - 32usize];
    ["Offset of field: _NV_ENC_SEQUENCE_PARAM_PAYLOAD::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_SEQUENCE_PARAM_PAYLOAD, reserved2) - 1032usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_EVENT_PARAMS"][::core::mem::size_of::<_NV_ENC_EVENT_PARAMS>() - 1544usize];
    ["Alignment of _NV_ENC_EVENT_PARAMS"][::core::mem::align_of::<_NV_ENC_EVENT_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_EVENT_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_EVENT_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_EVENT_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_EVENT_PARAMS, reserved) - 4usize];
    ["Offset of field: _NV_ENC_EVENT_PARAMS::completionEvent"]
        [::core::mem::offset_of!(_NV_ENC_EVENT_PARAMS, completionEvent) - 8usize];
    ["Offset of field: _NV_ENC_EVENT_PARAMS::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_EVENT_PARAMS, reserved1) - 16usize];
    ["Offset of field: _NV_ENC_EVENT_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_EVENT_PARAMS, reserved2) - 1032usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS"]
        [::core::mem::size_of::<_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS>() - 1552usize];
    ["Alignment of _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS"]
        [::core::mem::align_of::<_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS>() - 8usize];
    ["Offset of field: _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS::version"]
        [::core::mem::offset_of!(_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS, version) - 0usize];
    ["Offset of field: _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS::deviceType"]
        [::core::mem::offset_of!(_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS, deviceType) - 4usize];
    ["Offset of field: _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS::device"]
        [::core::mem::offset_of!(_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS, device) - 8usize];
    ["Offset of field: _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS::reserved"]
        [::core::mem::offset_of!(_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS, reserved) - 16usize];
    ["Offset of field: _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS::apiVersion"]
        [::core::mem::offset_of!(_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS, apiVersion) - 24usize];
    ["Offset of field: _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS::reserved1"]
        [::core::mem::offset_of!(_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS, reserved1) - 28usize];
    ["Offset of field: _NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS::reserved2"]
        [::core::mem::offset_of!(_NV_ENC_OPEN_ENCODE_SESSIONEX_PARAMS, reserved2) - 1040usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NV_ENCODE_API_FUNCTION_LIST"]
        [::core::mem::size_of::<_NV_ENCODE_API_FUNCTION_LIST>() - 2552usize];
    ["Alignment of _NV_ENCODE_API_FUNCTION_LIST"]
        [::core::mem::align_of::<_NV_ENCODE_API_FUNCTION_LIST>() - 8usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::version"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, version) - 0usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::reserved"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, reserved) - 4usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncOpenEncodeSession"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncOpenEncodeSession) - 8usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodeGUIDCount"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetEncodeGUIDCount) - 16usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodeProfileGUIDCount"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncGetEncodeProfileGUIDCount
    ) - 24usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodeProfileGUIDs"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncGetEncodeProfileGUIDs
    ) - 32usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodeGUIDs"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetEncodeGUIDs) - 40usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetInputFormatCount"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetInputFormatCount) - 48usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetInputFormats"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetInputFormats) - 56usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodeCaps"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetEncodeCaps) - 64usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodePresetCount"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncGetEncodePresetCount
    ) - 72usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodePresetGUIDs"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncGetEncodePresetGUIDs
    ) - 80usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodePresetConfig"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncGetEncodePresetConfig
    ) - 88usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncInitializeEncoder"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncInitializeEncoder) - 96usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncCreateInputBuffer"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncCreateInputBuffer) - 104usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncDestroyInputBuffer"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncDestroyInputBuffer) - 112usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncCreateBitstreamBuffer"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncCreateBitstreamBuffer
    ) - 120usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncDestroyBitstreamBuffer"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncDestroyBitstreamBuffer
    ) - 128usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncEncodePicture"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncEncodePicture) - 136usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncLockBitstream"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncLockBitstream) - 144usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncUnlockBitstream"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncUnlockBitstream) - 152usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncLockInputBuffer"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncLockInputBuffer) - 160usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncUnlockInputBuffer"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncUnlockInputBuffer) - 168usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodeStats"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetEncodeStats) - 176usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetSequenceParams"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetSequenceParams) - 184usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncRegisterAsyncEvent"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncRegisterAsyncEvent) - 192usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncUnregisterAsyncEvent"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncUnregisterAsyncEvent
    ) - 200usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncMapInputResource"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncMapInputResource) - 208usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncUnmapInputResource"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncUnmapInputResource) - 216usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncDestroyEncoder"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncDestroyEncoder) - 224usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncInvalidateRefFrames"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncInvalidateRefFrames
    ) - 232usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncOpenEncodeSessionEx"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncOpenEncodeSessionEx
    ) - 240usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncRegisterResource"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncRegisterResource) - 248usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncUnregisterResource"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncUnregisterResource) - 256usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncReconfigureEncoder"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncReconfigureEncoder) - 264usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::reserved1"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, reserved1) - 272usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncCreateMVBuffer"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncCreateMVBuffer) - 280usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncDestroyMVBuffer"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncDestroyMVBuffer) - 288usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncRunMotionEstimationOnly"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncRunMotionEstimationOnly
    ) - 296usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetLastErrorString"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetLastErrorString) - 304usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncSetIOCudaStreams"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncSetIOCudaStreams) - 312usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetEncodePresetConfigEx"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncGetEncodePresetConfigEx
    ) - 320usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncGetSequenceParamEx"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncGetSequenceParamEx) - 328usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncRestoreEncoderState"][::core::mem::offset_of!(
        _NV_ENCODE_API_FUNCTION_LIST,
        nvEncRestoreEncoderState
    ) - 336usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::nvEncLookaheadPicture"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, nvEncLookaheadPicture) - 344usize];
    ["Offset of field: _NV_ENCODE_API_FUNCTION_LIST::reserved2"]
        [::core::mem::offset_of!(_NV_ENCODE_API_FUNCTION_LIST, reserved2) - 352usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_PARAMS_FRAME_FIELD_MODE {
    NV_ENC_PARAMS_FRAME_FIELD_MODE_FRAME = 1,
    NV_ENC_PARAMS_FRAME_FIELD_MODE_FIELD = 2,
    NV_ENC_PARAMS_FRAME_FIELD_MODE_MBAFF = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_PARAMS_RC_MODE {
    NV_ENC_PARAMS_RC_CONSTQP = 0,
    NV_ENC_PARAMS_RC_VBR = 1,
    NV_ENC_PARAMS_RC_CBR = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_MULTI_PASS {
    NV_ENC_MULTI_PASS_DISABLED = 0,
    NV_ENC_TWO_PASS_QUARTER_RESOLUTION = 1,
    NV_ENC_TWO_PASS_FULL_RESOLUTION = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_STATE_RESTORE_TYPE {
